Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: Deleted allergies list
de_de: Gelöschte Allergien
el_gr: Λίστα διαγραμμένων αλλεργίων
it_it: Lista allergie eliminate

source: Allergic reaction
de_de: Allergische Reaktion
el_gr: Αλλεργία
it_it: Reazioni allergiche

source: Severity title
de_de: Schweregrad
el_gr: Σοβαρότητα
it_it: Gravità

source: Modify/Delete
de_de: Ändern/Löschen
el_gr: Αλλαγή/Διαγραφή
it_it: Modifica/Elimina

source: restore
de_de: wiederherstellen
el_gr: επαναφορά
it_it: Ripristina

source: Back
de_de: Zurück
el_gr: Πίσω
it_it: Indietro

source: Restore
de_de: Wiederherstellen
el_gr: επαναφορά
it_it: Ripristina

source: Allergies List
de_de: Allergien
el_gr: Αλλεργίες
it_it: Lista allergie

source: add an allergy
de_de: Allergie hinzufügen
el_gr: [εισαγωγή αλλεργίας]
it_it: aggiungi un'allergia

source: deleted allergies
de_de: gelöschte Allergien
el_gr: [διεγραμμένες αλλεργίες]
it_it: allergie eliminate

source: edit
de_de: bearbeiten
el_gr: μετατροπή
it_it: modifica

source: delete
de_de: löschen
el_gr: διαγραφή
it_it: elimina

source: [add an allergy]
de_de: [Allergie hinzufügen]
el_gr: [εισαγωγή αλλεργίας]
it_it: [aggiungi un'allergia]

source: [deleted allergies]
de_de: [gelöschte Allergien]
el_gr: [διεγραμμένες αλλεργίες]
it_it: [allergie eliminate]

source: 'Allergic reaction must be filled'
de_de: 'Allergische Reaktion muss eingetragen werden'
el_gr: 'Συμπληρώστε τον τίτλο της αλλεργίας'
it_it: 'Riempire il campo "reazione allergica"'

source: 'Severity must be filled'
de_de: 'Schweregrad muss eingetragen werden'
el_gr: 'Συμπληρώστε την σοβαρότητα της αλλεργίας'
it_it: 'Riempire il campo "Gravità"'

source: 'Type must be filled'
de_de: 'Art muss eingetragen werden'
el_gr: 'Συμπληρώστε την κατηγορια'
it_it: 'Riempire il campo "Tipo di allergia"'

source: New Allergy
de_de: Neue Allergie
el_gr: Νέα αλλεργία
it_it: Nuova Allergia

source: Allergy
de_de: Allergie
el_gr: Αλλεργία
it_it: Allergia

source: Type
de_de: Art
it_it: Tipo

source: Food allergy
de_de: Lebensmittelallergie
el_gr: Τροφική αλλεργία
it_it: Allergia alimentare

source: Environmental allergy
de_de: Umweltbedingte Allergie
el_gr: Περιβαλλοντική αλλεργία
it_it: Allergia ambientale

source: Drug allergy
de_de: Medikamentenallergie
el_gr: Αλλεργία σε φάρμακο
it_it: Allergia ai farmaci

source: Drug intolerance
de_de: Medikamentenunverträglichkeit
el_gr: Ευαισθησία σε φάρμακο
it_it: Intolleranza ai farmaci

source: Food intolerance
de_de: Nahrungsmittelunverträglichkeit
el_gr: Ευαισθησία σε φαγητό
it_it: Intolleranza alimentare

source: Drug class allergen
de_de: Wirkstoffklasse des Allergens
el_gr: Κατηγορία αλλεργιογόνου
it_it: Classe del principio attivo allergene

source: Severity
de_de: Schweregrad
el_gr: Σοβαρότητα
it_it: Gravità

source: Mild
de_de: Leicht
el_gr: Ήπια
it_it: Lieve

source: Moderate
de_de: Mittel
el_gr: Μέτρια
it_it: Moderata

source: Severe
de_de: Schwer
el_gr: Σοβαρή
it_it: Severa

source: Life Threatening
de_de: Lebensbedrohlich
el_gr: Απειλητική για τη ζωή
it_it: Potenzialmente letale

source: Fatal
de_de: Tödlich
el_gr: Θανατηφόρα
it_it: Letale

source: Mandatory Fields
de_de: Pflichtfelder
it_it: Campi obbligatori

source: What is a food allergy?
de_de: Was ist eine Lebensmittelallergie?
el_gr: Τι ειναι η τροφική αλλεργία
it_it: Cos’è un allergia alimentare?

source: A food allergy is an immune system response. It is caused when the body mistakes an ingredient in food — usually a protein — as harmful and creates a defense system (antibodies) to fight it. An allergic reaction occurs when the antibodies are battling an 'invading' food protein. The most common food allergies are shellfish, nuts, fish, eggs, peanuts and milk.
de_de: Eine Lebensmittelallergie ist eine Immunantwort. Sie wird ausgelöst, wenn der Körper einen Bestandteil der Nahrung - üblicherweise ein Protein - als schädlich einordnet und ein Abwehrsystem (Antikörper) bildet, um diesen zu bekämpfen. Eine allergische Reaktion tritt auf, wenn die Antikörper ein 'eindringendes' Lebensmittelprotein bekämpfen. Die häufigsten Lebensmittelallergien richten sich gegen Bestandteile in Schalentieren, Nüssen, Fisch, Eiern, Erdnüssen und Milch.
el_gr: Μια τροφική αλλεργία είναι μια αντίδραση του ανοσοποιητικού συστήματος που προκαλείται όταν το σώμαμπερδεύει ένα συστατικό στο φαγητό - συνήθως μια πρωτεΐνη - ως επιβλαβές και δημιουργείαμυνα (αντισώματα) για την καταπολέμησή του. Μια αλλεργική αντίδραση συμβαίνει όταντα αντισώματα μάχονται μια « εισβολή » της πρωτεΐνη τροφίμων.Η πιο συνηθισμένες αλλεργίες είναιοι αλλεργίες στα οστρακοειδή, ξηρούς καρπούς, ψάρι, αυγά, φιστίκια και γάλα.
it_it: Un’allergia alimentare è una risposta del sistema immunitario. Viene attivata quando il corpo scambia un ingrediente di un cibo – solitamente una proteina – per qualcosa di dannoso e genera una risposta difensiva per combatterlo. La reazione allergica avviene quando gli anticorpi combattono la proteina "invasore". Le più comuni allergie alimentari sono causate da molluschi, frutta secca, uova, e latte.

source: What is food intolerance?
de_de: Was ist eine Nahrungsmittelunverträglichkeit?
el_gr: Τι ειναι η ευαισθησία σε φαγητό
it_it: Intolleranza alimentare

source: Food intolerance is a digestive system response rather than an immune system response. It occurs when something in food irritates a person’s digestive system or when a person is unable to properly digest, or break down, the food. Intolerance to lactose, which is found in milk and other dairy products, is the most common food intolerance.
de_de: Eine Nahrungsmittelunverträglichkeit ist mehr eine Reaktion des Verdauungssystems, als eine Immunantwort. Sie tritt auf, wenn ein Bestandteil der Nahrung das Verdauungssystem reizt oder wenn eine Person nicht in der Lage ist die Nahrung richtig zu verdauen. Intoleranz gegenüber Laktose, welche in Milch und Milchprodukten zu finden ist, ist die häufigste Form.
el_gr: Η τροφική δυσανεξία αποτελεί μια αντίδραση στο πεπτικό σύστημα και όχι στο ανοσοποιητικό σύστημαΗ αντίδραση εμφανίζεται όταν κάτι στο φαγητό ερεθίζει το πεπτικό του ατόμουή όταν ένα άτομο δεν είναι σε θέση να αφομοιώσει σωστά ή να διασπάσει τηντρόφη. Η μη ανοχή στη λακτόζη, η οποία βρίσκεται στο γάλα και σε άλλα γαλακτοκομικά προϊόνταείναι η πιο κοινή δυσανεξία σε τρόφιμα.
it_it: L’intolleranza alimentare è una risposta del Sistema digestivo, diversa da quella invece del Sistema immunitario. Si verifica quando qualche sostanza in un cibo irrita il sistema digestivo o quando la persona non è in grado di digerire o scindere i componenti di un cibo. L’intolleranza al lattosio, una sostanza che si trova nel latte ed in altri prodotti caseari, è l’intolleranza alimentare più diffusa.

source: Add New Allergy
de_de: Neue Allergie hinzufügen
el_gr: Εισαγωγή αλλεργίας
it_it: Aggiungi una nuova allergia

source: Cancel
de_de: Abbrechen
el_gr: Άκυρο
it_it: Cancella

source: Allergen type
de_de: Allergentyp
el_gr: Τύπος αλλεργίας
it_it: Tipo di allergene

source: Severity
de_de: Schweregrad
el_gr: Σοβαρότητα
it_it: Gravità

source: Created at
de_de: Erstellt am
el_gr: Δημιουργήθηκε
it_it: Creata il

source: Back
de_de: Zurück
el_gr: Πίσω
it_it: indietro

source: Update Allergy
de_de: Allergie aktualisieren
el_gr: Ενημέρωση πληροφοριών αλλεργίας
it_it: Aggiorna allergia

source: Cancel
de_de: Abbrechen
el_gr: Άκυρο
it_it: Elimina

source: Additional Information
de_de: Zusätzliche Informationen
el_gr: Επιπρόσθετες πληροφορίες
it_it: Informazioni aggiuntive

source: Created at
de_de: Erstellt am
el_gr: Δημιουργήθηκε
it_it: Creata il

source: Deleted Appointments List
de_de: Gelöschte Termine
el_gr: Λίστα διεγραμμένων ραντεβού
it_it: Lista appuntamenti eliminati

source: Title
de_de: Titel
el_gr: Τιτλος
it_it: Titolo

source: Date
de_de: Datum
el_gr: Ημερομηνία
it_it: Data

source: Time
de_de: Uhrzeit
el_gr: Ώρα
it_it: Orario

source: Appointments List
de_de: Termine
el_gr: Λίστα ραντεβού
it_it: Lista appuntamenti

source: add an appointment
de_de: Termin hinzufügen
el_gr: Εισαγωγή ραντεβού
it_it: Aggiungi un appuntamento

source: deleted appointments
de_de: gelöschte Termine
el_gr: [διεγραμμένα ραντεβού]
it_it: Appuntamenti eliminati

source: Modify
de_de: Ändern
el_gr: Αλλαγή
it_it: Modifica

source: Delete
de_de: Löschen
el_gr: Διαγραφή
it_it: Elimina

source: [add an appointment ]
de_de: [Termin hinzufügen ]
el_gr: [εισαγωγή ραντεβού]
it_it: [aggiungi un appuntamento]

source: [deleted appointments]
de_de: [gelöschte Termine]
el_gr: [διεγραμμένα ραντεβου]
it_it: [appuntamenti eliminati]

source: 'Appointment title must be filled'
de_de: 'Titel des Termins muss eingetragen werden'
el_gr: 'Συμπληρώστε τον τίτλο του ραντεβου'
it_it: Riempire il campo Titolo dell΄appuntamento

source: 'Date must be filled'
de_de: 'Datum muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία λήξης'
it_it: 'Riempire il campo Data dell΄appuntamento'

source: 'Time must be filled'
de_de: 'Uhrzeit muss eingetragen werden'
el_gr: 'Συμπληρώστε την ωρα'
it_it: 'Riempire il campo ΄Orario΄ dell΄appuntamento'

source: New Appointment
de_de: Neuer Termin
el_gr: Νέο ραντεβού
it_it: Nuovo appuntamento

source: Appointment
de_de: Termin
el_gr: Ραντεβού
it_it: Appuntamento

source: Doctor's name
de_de: Name des Arztes
el_gr: Όνομα γιατρού
it_it: Nome del medico

source: Last name
de_de: Nachname
el_gr: Επώνυμο
it_it: Cognome

source: Name
de_de: Vorname
el_gr: Όνομα
it_it: Nome

source: Alert time
de_de: Erinnerungszeitpunkt
el_gr: Ώρα ενημέρωσης
it_it: Ora di avviso

source: Never
de_de: Nie
el_gr: Πότε
it_it: Mai

source: 5 minutes before
de_de: 5 Minuten vorher
el_gr: 5 λεπτά πρίν
it_it: 5 minuti prima

source: 30 minutes before
de_de: 30 Minuten vorher
el_gr: 30 λεπτά πρίν
it_it: 30 minuti prima

source: 60 minutes before
de_de: 60 Minuten vorher
el_gr: 60 λεπτά πρίν
it_it: 60 minuti prima

source: One day before
de_de: Einen Tag vorher
el_gr: Μια ημέρα πρίν
it_it: un giorno prima

source: Two days before
de_de: Zwei Tage vorher
el_gr: Δύο ημέρες πρίν
it_it: due giorni prima

source: Address
de_de: Adresse
el_gr: Διεύθυνση
it_it: Indirizzo

source: Locate on map
de_de: Auf der Karte anzeigen
el_gr: Τοποθεσία
it_it: Visualizza nelle mappe

source: Add New Appointment
de_de: Neuen Termin hinzufügen
el_gr: Εισαγωγή νέου ραντεβού
it_it: Aggiungi nuovo appuntamento

source: Street
de_de: Straße
el_gr: Δρόμος
it_it: Via

source: Street number
de_de: Hausnummer
el_gr: Αριθμός
it_it: Numero civico

source: Country
de_de: Land
el_gr: Χώρα
it_it: Nazione

source: City
de_de: Wohnort
el_gr: Πόλη
it_it: Città

source: Postal code
de_de: PLZ
el_gr: Ταχυδρομικός κώδικας
it_it: CAP

source: Map
de_de: Karte
el_gr: Χάρτης
it_it: Mappa

source: 'We cannot locate your address.Please complete next fields by yourself.'
de_de: Ihre Adresse konnte nicht gefunden werden. Bitte die folgenden Felder ausfüllen.
el_gr: 'Δεν μπορούμε να εντοπισουμε την διεύθυνση σας'
it_it: 'Non riusciamo a localizzare l’indirizzo selezionato. Per favore, completa manualmente i prossimi campi'

source: 'We cannot locate your address'
de_de: 'Ihre Adresse konnte nicht gefunden werden'
el_gr: 'Δεν μπορούμε να εντοπίσουμε την διεύθυνση σας'
it_it: 'Non riusciamo a localizzare l’indirizzo selezionato'

source: Edit Appointment
de_de: Termin bearbeiten
el_gr: Επεξεργασία ραντεβού
it_it: Modifica appuntamento

source: Update Appointment
de_de: Termin aktualisieren
el_gr: Ανανέωση ραντεβού
it_it: Aggiorna appuntamento

source: Comments
de_de: Kommentare
el_gr: Σχόλια
it_it: Commenti

source: Street address
de_de: Straße
el_gr: Διεύθυνση
it_it: Indirizzo

source: Zip code
de_de: PLZ
el_gr: Ταχυδρομικός κώδικας
it_it: CAP

source: languagecalendar
de_de: de
el_gr: el
it_it: it

source: Calendar
de_de: Kalender
el_gr: Ημερολόγιο
it_it: Calendario

source: Timeline
de_de: Zeitplan
el_gr: Ημερολόγιο σε μορφή γραμμών
it_it: Cronologia

source: Medications
de_de: Medikamente
el_gr: Φάρμακα
it_it: Farmaci

source: Problems
de_de: Probleme
el_gr: Προβλήματα
it_it: Problemi

source: Procedures
de_de: Prozeduren
el_gr: Επεμβάσεις
it_it: Interventi

source: Appointments
de_de: Termine
el_gr: Ραντεβού
it_it: Appuntamenti

source: Set window to last two months
de_de: Setze das Fenster auf die letzten zwei Monate
el_gr: Εμφάνισε τους τελευταίους δύο μήνες
it_it: Imposta intervallo finestra negli ultimi due mesi

source: Fit all items
de_de: Für alle Elemente anpassen
el_gr: Εμφάνισε όλα τα γεγονότα
it_it: Adatta per visualizzare tutti gli eventi

source: Zoom in
de_de: Vergrößern
el_gr: Μεγένθυση
it_it: Ingrandisci

source: Zoom out
de_de: Verkleinern
el_gr: Σμίκρυνση
it_it: Riduci

source: Move left
de_de: Nach links verschieben
el_gr: Μετακίνηση αριστερά
it_it: Muovi a sinistra

source: Move right
de_de: Nach rechts verschieben
el_gr: Μετακίνηση δεξιά
it_it: Muovi a destra

source: Today
de_de: Heute
el_gr: Σήμερα
it_it: Oggi

source: Day
de_de: Tag
el_gr: Ημέρα
it_it: Giorno

source: Week
de_de: Woche
el_gr: Εβδομάδα
it_it: Settimana

source: Month
de_de: Monat
el_gr: Μήνας
it_it: Mese

source: Save
de_de: Speichern
el_gr: Αποθήκευσε
it_it: Salva

source: Edit
de_de: Bearbeiten
el_gr: Μετατροπή
it_it: Modifica

source: Event will be deleted permanently, are you sure?
de_de: Soll das Ereignis unwiderruflich gelöscht werden?
el_gr: Το γεγονός θα διαγραφεί μόνιμα, είστε σίγουροι;
it_it: L'evento verrà rimosso definitivamente, sei sicuro di procedere?

source: Description
de_de: Beschreibung
el_gr: Περιγραφή
it_it: Descrizione

source: Time period
de_de: Zeitraum
el_gr: Χρονική περίοδος
it_it: Periodo di tempo

source: Full day
de_de: ganzer Tag
el_gr: Ολόκληρη ημέρα
it_it: Intera giornata

source: Date
de_de: Datum
el_gr: Ημέρα
it_it: Data

source: Year
de_de: Jahr
el_gr: Χρόνος
it_it: Anno

source: Please select an application.
de_de: Bitte eine Behandlung wählen.
el_gr: Παρακαλώ διαλέξτε εφαρμογή
it_it: Per favore, seleziona un’applicazione

source: 'Start date must be filled'
de_de: 'Startdatum muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία έναρξης'
it_it: 'Aggiungere la data di inizio assunzione'

source: 'End date must be filled'
de_de: 'Enddatum muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία λήξης'
it_it: 'Aggiungere la data di fine assunzione'

source: 'Drug name title must be filled'
de_de: 'Medikamentenname muss eingetragen werden'
el_gr: 'Συμπληρώστε τον τίτλο του φαρμακου'
it_it: 'Aggiungere il nome del medicinale'

source: 'Date of fill must be filled'
de_de: 'Datum der Abfüllung muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία'
it_it: 'Aggiungere data di compilazione'

source: 'Dispense days supply must be filled'
de_de: Einnahmezeitraum (in Tagen) muss eingetragen werden '
el_gr: 'Συμπληρώστε τις ημέρες προμήθειας φαρμάκου'
it_it: 'Aggiungere i giorni o la frequenza di assunzione'

source: New Medication
de_de: Neues Medikament
el_gr: Νέο φάρμακο
it_it: Nuovo farmaco

source: Medication
de_de: Medikament
el_gr: Φάρμακο
it_it: Farmaco

source: End date of medication
de_de: Enddatum der Medikation
el_gr: Ημερομηνία λήξης φαρμάκου
it_it: Data termine assunzione del farmaco

source: Quantity value
de_de: Menge
el_gr: Ποσότητα
it_it: Valore quantità

source: Quantity unit
de_de: Einheit
el_gr: Μονάδα ποσότητας
it_it: Unità di misura quantità

source: Frequency value
de_de: Einnahmehäufigkeit
el_gr: Τιμή συχνότητας
it_it: Valore frequenza

source: Frequency unit
de_de: Einheit der Frequenz
el_gr: Μόναδα συχνότητας
it_it: Unità di misura frequenza

source: Instructions
de_de: Anweisungen
el_gr: Οδηγίες
it_it: Istruzioni

source: Provenance title
de_de: Herkunftstitel
el_gr: Περιοχή
it_it: Origine

source: Prescription
de_de: Rezept
el_gr: Συνταγή
it_it: Ricetta

source: Fulfillment
de_de: Erfüllung
el_gr: Επιπλέον πληροφορίες

source: Administration
de_de: Verwaltung
el_gr: Διαχείριση
it_it: Registrazione

source: Reconciliation
de_de: Abstimmung
el_gr: Συνδιαλλαγή
it_it: Risoluzione

source: Patient Report
de_de: Patientenbericht
el_gr: Φάκελος ασθενούς
it_it: Cartella clinica

source: Dispense Days Supply
de_de: Einnahmezeitraum (in Tagen)
el_gr: Ημέρες προμήθειας
it_it: 'Aggiungere i giorni o la frequenza di assunzione'

source: Start date of medication
de_de: Start der Medikation
el_gr: Ημερομηνία έναρξης φαρμάκου
it_it: Data di inizio assunzione del farmaco

source: Toggle Extra information
de_de: Ein-/Ausblenden von Zusatzinformationen
el_gr: Κρύψε επιπρόσθετες πληροφορίες
it_it: Attiva informazioni aggiuntive

source: Pharmacy id
de_de: Apotheken Id
el_gr: Κωδικός φαρμάκου
it_it: Identificativo farmacia

source: Pharmacy organization
de_de: Apotheke
el_gr: Εταιρεία φαρμάκου
it_it: Nome farmacia

source: Country of pharmacy
de_de: Land
el_gr: Χώρα προέλευσης φαρμάκου
it_it: Nazione farmacia

source: City of pharmacy
de_de: Stadt
el_gr: Πόλη φαρμακείου
it_it: Comune farmacia

source: Postalcode of pharmacy
de_de: PLZ
el_gr: Ταχυδρομικός κώδικας φαρμακείου
it_it: CAP farmacia

source: Street of pharmacy
de_de: Straße
el_gr: Διεύθυνση φαρμακείου
it_it: Indirizzo farmacia

source: Provider dea number
de_de: DEA Nummer des Anbieters
el_gr: Αριθμός dea παρόχου
it_it: Nome prescrittore

source: Provider npi number
de_de: NPI Nummer des Anbieters
el_gr: Αριθμός npi παρόχου
it_it: Nome prescrittore

source: Provider email
de_de: E-Mail des Anbieters
el_gr: Ηλεκτρονική διεύθυνση παρόχου
it_it: Email prescrittore

source: Provider name
de_de: Vorname des Anbieters
el_gr: Όνομα παρόχου
it_it: Nome prescrittore

source: Provider family name
de_de: Nachname des Anbieters
el_gr: Επίθετο παρόχου
it_it: Cognome prescrittore

source: Provider telephone type
de_de: Telefontyp des Anbieters
el_gr: Τύπος τηλεφώνου παρόχου
it_it: Tipo recapito telefonico prescrittore

source: Provider telephone
de_de: Telefonnummer des Anbieters
el_gr: Τηλέφωνο παρόχου
it_it: Telefono prescrittore

source: Preferred number
de_de: Bevorzugte Nummer
el_gr: Προτειμόμενος αριθμός
it_it: Numero preferito

source: True
de_de: Wahr
el_gr: Σωστό
it_it: Vero

source: False
de_de: Falsch
el_gr: Λάθος
it_it: Falso

source: Quantity dispensed value
de_de: Ausgabemenge
el_gr: Ποσότητα φαρμάκου
it_it: Valore quantità prescritta

source: Quantity dispensed unit
de_de: Ausgabeeinheit
el_gr: Μονάδα μέτρησης ποσότητας φαρμάκου
it_it: Unità di misura quantità prescritta

source: Add New Medication
de_de: Neues Medikament hinzufügen
el_gr: Νέο φάρμακο
it_it: Aggiungi un nuovo farmaco

source: Frequenct unit
de_de: Einheit der Frequenz
el_gr: Μονάδα συχνότητας
it_it: Unità di misura frequenza

source: Instructions
de_de: Anweisungen
el_gr: Οδηγίες
it_it: Istruzioni

source: Add extra information
de_de: Zusätzliche Informationen angeben
el_gr: Εμφάνισε επιπρόσθετες πληροφορίες
it_it: Inserisci informazioni aggiuntive

source: Hide extra information
de_de: Zusätzliche Informationen verbergen
el_gr: Κρύψε επιπρόσθετες πληροφορίες
it_it: Nascondi informazioni aggiuntive

source: 'Please fill title.'
de_de: 'Bitte Titel eintragen.'
el_gr: 'Παρακαλώ συμπληρώστε όλα τα πεδία'
it_it: 'Per favore, inserisci il titolo'

source: 'Please fill date.'
de_de: 'Bitte Datum eintragen.'
el_gr: 'Παρακαλώ συμπληρώστε την ημερομηνία'
it_it: 'Per favore, inserisci la data'

source: New Procedure
de_de: Neue Prozedur
el_gr: Νέα επέμβαση
it_it: Nuovo Intervento

source: Procedure
de_de: Prozedur
el_gr: Επέμβαση
it_it: Intervento

source: Date Performed
de_de: Ausführungsdatum
el_gr: Ημερομηνία
it_it: Data di esecuzione

source: Doctor Name
de_de: Name des Arztes
el_gr: Όνομα γιατρού
it_it: Nome del medico

source: Location
de_de: Standort
el_gr: Τοποθεσία
it_it: Indirizzo

source: Add New Procedure
de_de: Neue Prozedur hinzufügen
el_gr: Νέα επέμβαση
it_it: Aggiungi nuovo intervento

source: Cancel
de_de: Abbrechen
el_gr: Άκυρο
it_it: Elimina

source: Deleted Questionnaires List
de_de: Gelöschte Fragebögen
el_gr: [διεγραμμένες ερωτηματολολόγια]
it_it: Questionari eliminati

source: Record id
de_de: Datensatz ID
el_gr: Αριθμός ασθενούς
it_it: ID Cartella

source: Gender
de_de: Geschlecht
el_gr: Φύλο
it_it: Sesso

source: Deleted Problems List
de_de: gelöschte Probleme
el_gr: Λίστα προβλημάτων
it_it: Lista problemi eliminati

source: Onset
de_de: Beginn
el_gr: Ημερομηνία έναρξης
it_it: Insorgenza

source: Resolution
de_de: Auflösung
el_gr: Λήξη
it_it: Risoluzione

source: Problems List
de_de: Problemliste
el_gr: Λίστα προβλημάτων
it_it: Lista problemi

source: add a problem
de_de: Problem hinzufügen
el_gr: [εισαγωγή προβλήματος]
it_it: Aggiungi un problema

source: deleted problems
de_de: Gelöschte Probleme
el_gr: [διεγραμμένα προβλήματα]
it_it: Problemi eliminati

source: Cancer Clinical Assessment Questionnaires
de_de: Fragebögen zur klinischen Einschätzung des Krebses
it_it: Questionari di Assessment Clinico Oncologico

source: New Cancer Clinical Assessment
de_de: Neue klinische Krebseinschätzung
it_it: Nuovo Assessment Clinico Oncologico

source: Deleted questionnaires
de_de: Gelöschte Fragebögen
el_gr: [διεγραμμένα ερωτηματολόγια ]
it_it: Questionari eliminati

source: Patient Name
de_de: Patientenname
el_gr: Όνομα Ασθενή
it_it: Nome paziente

source: Patient name
de_de: Patientenname
el_gr: Όνομα Ασθενή
it_it: Nome paziente

source: Patient id
de_de: Patienten ID
el_gr: Αριθμός Ασθενή
it_it: ID paziente

source: 'Age of diagnosis must be a number'
de_de: 'Das Alter zum Zeitpunkt der Diagnose muss eine Zahl sein'
it_it: 'L’età di diagnosi deve essere in format numerico'

source: 'Age of diagnosis must be filled'
de_de: 'Das Alter zum Zeitpunkt der Diagnose muss eingetragen werden'
el_gr: 'Συμπληρώστε την ηλικία διάγνωσης'
it_it: 'Aggiungere età alla diagnosi'

source: 'Please select one treatment'
de_de: 'Bitte eine Behandlung wählen'
el_gr: 'Παρακαλώ επιλέξτε θεραπεία'
it_it: 'Per favore seleziona un trattamento'

source: New Cancer Clinical Assessment Questionnaire
de_de: Neuer Fragebogen zur klinischen Einschätzung des Krebses
it_it: Nuovo Questionario di Assessment Clinico Oncologico

source: -- select a patient --
de_de: -- Patient wählen --
el_gr: --Επίλεξε ενα ασθενή--
it_it: --Seleziona un paziente--

source: Age at diagnosis
de_de: Alter zum Zeitpunkt der Diagnose
it_it: Età alla diagnosi

source: Male
de_de: Männlich
el_gr: Αρσενικό
it_it: Uomo

source: Female
de_de: Weiblich
el_gr: Θηλυκό
it_it: Donna

source: Diagnosis
de_de: Diagnose
it_it: Diagnosi

source: CNS tumour
de_de: ZNS Tumor
it_it: Tumore del Sistema nervoso centrale

source: Neuroblastoma
de_de: Neuroblastom

source: Nephroblastoma
de_de: Nephroblastom
it_it: Nefroblastoma

source: Hepatoblastoma
de_de: Hepatoblastom
it_it: Epatoblastoma

source: Retinoblastoma
de_de: Retinoblastom

source: Soft tissue sarcoma
de_de: Weichgewebesarkom
it_it: Sarcoma dei tessuti molli

source: Osteosarcoma
de_de: Osteosarkom

source: Ewing Sarcoma
de_de: Ewing Sarkom
it_it: Sarcoma di Ewing

source: Germ cell tumour
de_de: Keimzelltumor
it_it: Tumore alle cellule germinali

source: Other (if other, pleace specify)
de_de: Andere (bitte genau benennen)
it_it: Altro (per favore specificare)

source: Specify diagnosis (if other)
de_de: Diagnose näher beschreiben (falls andere)
it_it: Specifica diagnosi (se diversa)

source: Initial diagnosis or relapse
de_de: Erstdiagnose oder Rückfall
it_it: Diagnosi iniziale o recidiva

source: Initial
de_de: Erstdiagnose
it_it: Iniziale

source: 1rst relapse
de_de: erster Rückfall
it_it: 1a recidiva

source: 2nd relapse
de_de: zweiter Rückfall
it_it: 2a recidiva

source: higher than 2nd relapse
de_de: mehr als zwei Rückfälle
it_it: Oltre la 2a recidiva

source: Treatment (select treatments)
de_de: Behandlung (Behandlungen auswählen)
it_it: Trattamento (selezioni trattamenti)

source: 100 – Normal; no complaints; no evidence of disease.
de_de: 100 - Normal; keine Beschwerden; keine Anzeichen von Krankheit.
it_it: 100 – Normale; Nessun disturbo, nessun segno di malattia.
