Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: This account has been disabled/locked.
de_de: Dieser Account wurde deaktiviert oder gesperrt.
el_gr: Αυτός ο λογαριασμός έχει απενεργοποιήθει/κλειδωθεί
it_it: Questo account è stato disabilitato/bloccato.

source: This account does not exist on the server.
de_de: Dieser Account existiert nicht auf dem Server.
el_gr: Ο λογαριασμός δεν υπάρχει στην βάση δεδομένων.
it_it: Questo account non esiste sul server.

source: Online registration is not available.
de_de: Online Registrierung nicht verfügbar.
el_gr: Η απευθείας εγγραφή δεν είναι διαθέσιμη.
it_it: La registrazione online non è disponibile.

source: The confirmation code was wrong. Please try again.
de_de: Der Bestätigungscode war falsch. Bitte versuchen Sie es erneut.
el_gr: Ο κωδικός επιβεβαίωσης είναι λάθος. Παρακαλώ προσπαθήστε ξανά.
it_it: Il codice di conferma è errato. Per favore, riprova.

source: There was a problem setting up your account. Please try again.
de_de: Es gab ein Problem beim Einrichten Ihres Accounts. Bitte versuchen Sie es erneut.
el_gr: Υπήρχε ένα πρόβλη κατά την δημιουργία του λογαριασμού σας. Παρακαλαώ προσπαθήστε ξανά.
it_it: C΄è stato un problema nella creazione dell'account. Per favore, riprova.

source: There was a problem updating your data. Please try again. If you are unable to change your password please contact support.
de_de: Es gab ein Problem beim aktualisieren Ihrer Daten. Bitte versuche es erneut. Wenn Sie nicht in der Lage sind Ihr Passwort zu ändern, wenden Sie sich bitte an den Support.
el_gr: Υπήρξε ενα πρόβλημα στην ενημέρωση των στοιχείων σας. Παρακαλώ προσπαθήστε ξανά. Εάν δεν είναι δυνατήη αλλαγή του κωδικού σας παρακαλώ επικοινωνήστε με την υποστήριξη.
it_it: C΄è stato un problema con l'aggiornamento dei tuoi dati. Per favore, riprova. Se non riesci a modificare la password, contatta il supporto.

source: This username is too short, please choose a different one
de_de: Dieser Benutzername ist zu kurz, bitte wählen Sie einen anderen
el_gr: Αυτό το ψευδώνυμο είναι πολύ μικρό, παρακαλώ επιλέξτε ενα διαφορετικό
it_it: Il nome utente è troppo breve, scegline un altro per favore.

source: That username is already taken, please enter a different one
de_de: Dieser Benutzername ist schon vergeben, bitte wählen Sie einen anderen
el_gr: Αυτό το ψευδώνυμο χρησιμοποιείται ήδης, παρακαλώ επιλέξτε ενα διαφορετικό
it_it: Questo username è già in uso, scegline un altro per favore.

source: The password is too short
de_de: Das Passwort ist zu kurz
el_gr: Ο κωδικός είναι πολύ μικρός
it_it: La password è troppo breve

source: Your passwords do not match, please try again
de_de: Ihre Passwörter stimmt nicht überein, bitte versuchen Sie es erneut
el_gr: Οι κωδικοί σας δεν ταιριάζουν, παρακαλαώ προσπαθήστε ξανά
it_it: Le password non coincidono. Per favore, riprova

source: The current password is wrong, please try again
de_de: Das Passwort ist falsch, bitte versuchen Sie es erneut
el_gr: Ο κωδικός είναι λανθασμένος, παρακαλαώ προσπαθήστε ξανά
it_it: Questa password non è esatta. Per favore, riprova.

source: There was a problem updating your password. Please try again. If you are unable to set up your account please contact support.
de_de: Es gab ein Problem beim Aktualisieren Ihres Passwortes. Bitte versuchen Sie es erneut. Wenn Sie nicht in der Lage sind Ihren Account zu ändern, wenden Sie sich bitte an den Support.
el_gr: Υπήρξε κάποιο πρόβλημα κατά την ενημέρωση του κωδικού σας. Παρακαλώ προσπαθήστε ξανά. Εάν δεν ειναι δυνατή η δημιουργία του λογαριασμού παρακαλώ επικοινωνήστε με την υποστήριξη.
it_it: C΄è stato un problema nell'aggiornamento della password. Per favore, riprova. Se non riesci a creare un account, contatta il supporto.

source: There was a problem resetting your password. Please try again. If you are unable to set up your account please contact support.
de_de: Es gab ein Problem beim Zurücksetzen Ihres Passwortes. Bitte versuchen Sie es erneut. Wenn Sie nicht in der Lage sind Ihren Account zu ändern, wenden Sie sich bitte an den Support.
el_gr: Υπήρξε πρόβλημα στην επαναφορά του κωδικού σας. Παρακαλώ προσπαθήστε ξανά. Εάν ειναι αδύνατο να δημιουργήσετε τον λογαριασμό σας παρακαλώ επικοινωνήστε με την υποστήριξη.
it_it: C΄è stato un problema nel reimpostare la password. Per favore, riprova. Se non riesci a creare l'account, contatta il supporto.

source: Please provide a name if you wish to create a record
de_de: Bitte geben Sie einen Namen ein, wenn Sie einen Datensatz erstellen möchten
el_gr: Παρακαλώ εισάγετε ενα όνομα εάν θέλετε να δημιουργήσετε έναν φάκελο
it_it: Per favore, inserisci un nome per creare una cartella

source: This carenet name is already taken, please choose a different one
de_de: Dieser Versorgungsnetzwerk Name ist schon vergeben, bitte wählen Sie einen anderen
el_gr: Το όνομα αύτης της όμαδς χρησιμοποιείται ήδη, παρακαλώ επιλέξτε ένα διαφορετικό
it_it: Questo nome per il carenet è già in uso. Per favore, scegline un altro

source: There was a problem resetting your password. Please contact support.
de_de: Es gab ein Problem beim Zurücksetzen Ihres Passwortes. Bitte kontaktieren Sie den Support.
el_gr: Υπήρξε πρόβλημα κατά την επαναφορά του κωδικού σας. Παρακαλώ επικοινωνήστε με την υποστήριξη.
it_it: C΄è stato un problema nel reimpostare la password. Per favore, contatta il supporto.

source: There was a problem retrieving app information. Please try again.
de_de: Es gab ein Problem beim Empfangen von App Informationen. Bitte versuchen Sie es erneut.
el_gr: Υπήρξε πρόβλημα κατά την ανάκτηση των πληροφοριών της εφαρμογής. Παρακαλώ προσπαθήστε ξανά.
it_it: C΄è stato un problema nel recupero delle informazioni dell'applicazione. Per favore, riprova.

source: There was a problem retrieving app information (Start URL missing). Please contact support.
de_de: Es gab ein Problem beim Empfangen von App Informationen (Start URL fehlt). Bitte kontaktieren Sie den Support.
el_gr: Υπήρξε πρόβλημα στην ανάκτηση των πληροφοριών της εφαρμογής (Αρχίκη ηλεκτρονική διεύθυνση λείπει). Παρακαλώ επικοινωνήστε με την υποστήριξη.
it_it: C΄è stato un problema nel recupero delle informazioni dell'applicazione (Manca l'URL iniziale). Per favore, contatta il supporto.

source: This App does not exist
de_de: Diese App existiert nicht
el_gr: Αυτή η εφαρμογή δεν υπάρχει
it_it: Questa App non esiste

source: You are not authorized
de_de: Sie sind nicht berechtigt
el_gr: Δεν είστε εξουδιοδοτημένος
it_it: Non sei autorizzato

source: The server is currently unavailable. Please try again in a few minutes.
de_de: Der Server ist derzeit nicht verfügbar. Bitte versuchen Sie es in ein paar Minuten erneut.
el_gr: Το σύστημα είναι προσωρινά μη διαθέσιμο. Παρακαλώ προσπαθήστε σε λίγα λεπτα.
it_it: Il server non è al momento disponibile. Per favore, riprova tra qualche minuto.

source: You were logged out
de_de: Sie wurden abgemeldet
el_gr: Αποσυνδεθήκατε
it_it: Sei uscito dall'account

source: Your password has been changed
de_de: Ihr Passwort wurde geändert
el_gr: Ο κωδικός έχει αλλάξει
it_it: La tua password è stata modificata

source: Administrator user added successfully
de_de: Administrator erfolgreich hinzugefügt
it_it: Utente amministratore aggiunto correttamente

source: You have successfully registered.
de_de: Sie haben sich erfolgreich registriert.
el_gr: Εγγραφήκατε επιτυχώς
it_it: Registrazione avvenuta con successo

source: After an administrator has approved your account you may login.
de_de: Nachdem ein Administrator Ihren Account bestätigt hat, können Sie sich anmelden.
el_gr: Μπορείτε να συνδεθείτε μόλις κάποιος διαχειριστής θα έχει δεχτεί το αίτημα σας
it_it: Potrai eseguire l'accesso quando l'amministratore avrà approvato il tuo account

source: At the link sent to your email address, enter the following confirmation code:
de_de: Es wurde Ihnen eine E-Mail mit einem Link gesendet. Klicken Sie auf diesen Link und geben Sie dort den folgenden Bestätigungscode ein:
el_gr: Στην ηλεκτρονική διεύθυνση που εστάλη στο ηλεκτρονικό σας ταχυδρομείο εισάγετε τον παρακάτω κωδικο:
it_it: Riceverai una mail contenente un link che indirizza ad una pagina web. Quando ti verrà richiesto, inserisci il seguente codice di conferma:

source: Use the link sent to your email address to proceed with account activation
de_de: Verwenden Sie den Link in Ihrer E-Mail, um mit der Accountaktivierung fortzufahren
el_gr: Χρησιμοποιήστε την ηλεκτρονική διεύθυνση που εστάλη στο ηλεκτρονικό σας ταχυδρομείο
it_it: Utilizza il link che ti è stato inviato all'indirizzo mail da te indicato per procedere con l'attivazione dell'acount

source: The activation email has been sent
de_de: Die E-Mail zur Aktivierung wurde versendet
el_gr: Το μήνυμα ενεργοποιήσης έχει σταλεί
it_it: La mail di attivazione è stata inviata

source: Your account is now active, you may log in below
de_de: Ihr Account ist nun aktiv, Sie können sich jetzt unten anmelden
el_gr: Ο λογαριασμός σας ειναι τώρα ενεργός, μπορείτε να συνδεθείτε παρακάτω
it_it: Il tuo account è attivo, puoi eseguire il login qui sotto

source: Successfully created new record
de_de: Neuer Datensatz wurde erfolgreich erstellt
el_gr: Επιτυχής δημιουργία φακέλου
it_it: Nuova cartella creata con successo

source: New carenet
de_de: Neues Versorgungsnetzwerk
el_gr: Νέα ομάδα
it_it: Nuovo carenet

source: Authorize "{{name}}"?
de_de: Autorisiere "{{name}}"?
el_gr: Εξουσιοδότηση "{{name}}"?
it_it: Autorizzare ""{{name}}"?

source: No accounts
de_de: Keine Accounts
el_gr: Δεν υπάρχει ο λογαριασμός
it_it: Nessun account

source: There was an error creating your new carenet:
de_de: Beim Erstellen Ihres neuen Versorgungsnetzwerkes ist ein Fehler aufgetreten:
el_gr: Υπήρχε ένα πρόβλη κατά την δημιουργία του λογαριασμού σας. Παρακαλαώ προσπαθήστε ξανά.
it_it: C΄è stato un errore nel creare il carenet:

source: There was an error creating your new carenet, please try again
de_de: Beim Erstellen Ihres neuen Versorgungsnetzwerkes ist ein Fehler aufgetreten, bitte versuchen Sie es erneut
el_gr: Υπήρχε ένα πρόβλη κατά την δημιουργία του λογαριασμού σας. Παρακαλαώ προσπαθήστε ξανά.
it_it: C΄è stato un errore nel creare il carenet, per favore riprova

source: Delete this carenet?\n\nThis action cannot be undone
de_de: Dieses Versorgungsnetzwerk löschen?\n\nDiese Aktion kann nicht rückgängig gemacht werden
it_it: Cancellare questo carenet?\n\nQuesta azione è irreversibile

source: There was an error deleting the carenet, please try again
de_de: Beim Löschen des Versorgungsnetzwerkes ist ein Fehler aufgetreten, bitte versuchen Sie es erneut
el_gr: Υπήρχε ένα πρόβλη κατά την δημιουργία του λογαριασμού σας. Παρακαλαώ προσπαθήστε ξανά.
it_it: C΄è stato un errore nell'eliminazione del carenet, per favore riprova

source: Start by creating a record for this account
de_de: Beginnen Sie, indem Sie einen neuen Datensatz für diesen Account anlegen
it_it: Comincia creando un record per questo account

source: Disable this app?\n\nBy disabling this app it will also be removed from your carenets
de_de: Diese App deaktivieren?\n\nWenn sie diese App deaktivieren wird sie auch von Ihren Versorgungsnetzwerken entfernt
it_it: Disabilitare questa applicazione?\n\nDisabilitando questa applicazione sarà anche rimossa dai tuoi carenet

source: Are you sure you want to enable
de_de: Sind Sie sicher, dass Sie aktivieren möchten
it_it: Sei sicuro di voler abilitare

source: This app is no longer available
de_de: Diese App ist nicht mehr verfügbar
it_it: Questa applicazione non è più disponibile

source: This app is not available
de_de: Diese App ist nicht verfügbar
it_it: Questa applicazione non è disponibile

source: Sorry, but we were unable to enable this app.
de_de: Entschuldigung, aber wir waren nicht in der Lage diese App zu aktivieren.
it_it: Siamo spiacenti, non è possibile abilitare questa applicazione

source: You must add this account to at least one carenet in order to to keep it in your accounts list
de_de: Sie müssen diesen Account zu mindestens einem Versorgungsnetzwerk hinzufügen, damit er in Ihrer Accountliste bleiben kann.
el_gr: Πρέπει να εισάγετε αυτόν τον λογαριασμό σε τουλάχιστον μία ομάδα για να διατηρηθεί στην λίστα λογαριασμών σας
it_it: Devi aggiungere questo account ad almeno un carenet per mantenerlo nella lista dei tuoi account

source: Add account (email)
de_de: Account hinzufügen (E-Mail)
el_gr: Εισαγωγή λογαριασμόυ (ηλεκτρονική διεύθυνση)
it_it: Aggiungi account (email)

source: Add
de_de: Hinzufügen
el_gr: Εισαγωγή
it_it: Aggiungi

source: Add guardian
de_de: Vormund hinzufügen
it_it: Aggiungi Paziente

source: (A guardian is a person that you share your whole personal health record. For example children under 16 years old have to share their personal health record with an adult in order to manage it. )
de_de: (Ein Vormund ist eine Person, mit der Sie Ihre gesamten persönlichen Gesundheitsdaten teilen. Beispielsweise müssen Kinder unter 16 Jahren ihre Daten mit einem Erwachsenen teilen, um sie zu verwalten.)
it_it: (Un custode è la persona con cui condividi tutto la tua cartella clinica personale. Per esempio i ragazzi al di sotto dei 16 anni devono condividere la loro cartella clinica personale con un adulto per poterla gestire)

source: Add guardian (email)
de_de: Vormund hinzufügen (E-Mail)
it_it: Aggiungi custode (email)

source: Drop an account
de_de: Durch Ziehen-und-loslassen einen Account hinzufügen
el_gr: Αφαιρέστε ενα λογαριασμό
it_it: Rimuovi account

source: Sharing for
de_de: Freigabe für
el_gr: Κοινή χρήση για
it_it: Condividi con

source: Your Indivo record contains care networks. A care network is a place for you to share some of your health information with a subset of individuals you select. For example, the "Family" care network is where you might invite your loved ones to view most of your health information, while the "Work" care network will include only people you work with and a much smaller subset of your health information.
de_de: Ihr Indivo Datensatz enthält Versorgungsnetzwerke. Ein Versorgungsnetzwerk ist ein Ort an dem Sie einige Ihrer Gesundheitsinformationen mit einer Gruppe von Personen, die Sie wählen, teilen können. Im "Familien" Versorgungsnetzwerk werden sie beispielsweise die Ihnen nahestehenden Personen einladen, um mit diesen dann eine große Anzahl ihrer Gesundheitsinformationen zu teilen. Wohingegen das Versorgungsnetz "Arbeit" nur eine geringe Anzahl von Personen enthalten wird, denen Sie dann auch nur einen kleineren Teil Ihrer Gesundheitsinformationen zur Verfügung stellen werden.
el_gr: Ο λογαριασμός σας στο Indivo περιέχει δίκτυα φροντίδας. Ένα δίκτυο φροντίδας είναι ένα μέρος στο οποίο μπορείς να μοιραστείς κάποιες απο τις πληροφορίες που αφορούν την υγεία σου με ένα υποσύνολο ατόμων που επιλέγεις. Για παράδειγμα, η ομάδα "Οικογένεια" είναι ένα δίκτυο που μπορείς να καλέσεις τους αγαπημένου σου ωστέ να παρακολούθησουν τις περισσότερες από της πληροφορίες της υγείας σου, ενώ η ομάδα "Δουλειά" θα συμπεριλαμβάνει μόνο άτομα από το εργασιακό σου περιβάλλον που θα παρακολουθούν ένα πολύ μικρότερο σύνολο των πληροφοριών σου
it_it: Il tuo record Indivo contiene dei care network. Un care network è un modo per condividere alcune delle tue informazioni sanitaria con un sottogruppo di individui a tua scelta. Ad esempio, il care network "Famiglia" è un modo per invitare i tuoi cari a visualizzare la maggior parte delle informazioni sul tuo stato di salute, mentre il care network "Lavoro" include solo le persone con cui lavori e una quantità inferiori di informazioni sul tuo stato di salute.

source: Known accounts
de_de: Bekannte Accounts
el_gr: Γνωστοί λογαριασμοί
it_it: Account conosciuti

source: (Accounts that you have already added to a carenet)
de_de: (Accounts, die Sie bereits zu einem Versorgungsnetzwerk hinzugefügt haben)
it_it: (Account che hai già aggiunto al tuo carenet)

source: Loading accounts
de_de: Lade Accounts
el_gr: Φόρτωση λογαριασμών
it_it: Sto caricando gli account

source: Add companion
de_de: Begleiter hinzufügen
el_gr: Εισαγωγή κηδεμόνα
it_it: Aggiungi compagno

source: Loading companion
de_de: Lade Begleiter
el_gr: Φόρτωση ομάδων
it_it: Sto caricando i compagni

source: Drag accounts to carenets to start sharing with them
de_de: Ziehe Accounts zu einem Versorgungsnetzwerk, um den Austausch zu initiieren
el_gr: Σείρετε λογαριασμόυ στις παρακάτω ομάδες ώστε να ξεκινήσετε να μοιράζεστε μαζί τους
it_it: Trascina gli account sui carenet per cominciare a condividere informazioni con gli altri

source: Loading carenets
de_de: Lade Versorgungsnetzwerke
el_gr: Φόρτωση ομάδων
it_it: Sto caricando i carenet

source: no notifications
de_de: keine Benachrichtigungen
el_gr: καμμία ενημέρωση
it_it: Nessuna notifica

source: sent by
de_de: gesendet von
el_gr: στάλθηκε από
it_it: Inviata da

source: about
de_de: über
el_gr: για
it_it: Informazioni

source: record
de_de: Datensatz
el_gr: φάκελος

source: (background app)
de_de: (Hintergrund App)
el_gr: (εφαρμογή παρασκηνίου)
it_it: (app in background)

source: Back to message list
de_de: Zurück zur Nachrichtenliste
el_gr: Επιστροφή στην λίστα μηνυμάτων
it_it: Torna alla lista messaggi

source: About
de_de: Über uns
el_gr: Για
it_it: Informazioni

source: Received
de_de: Empfangen
el_gr: Ελήφθει
it_it: Ricevuto

source: Attachments
de_de: Anhänge
el_gr: Συννημένα
it_it: Allegati

source: Accepted into Record
de_de: In Datensatz aufgenommen
el_gr: Αποδεκτό στον φάκελο
it_it: Accettato nel record

source: Accept into Record
de_de: Im Datensatz aufnehmen
el_gr: Αποδεκτό στον φάκελο
it_it: Accetta nel record

source: Displaying messages for:
de_de: Nachrichten anzeigen für:
el_gr: Εμφανίζονται τα ηλεκτρονικά μηνύματα για τους:
it_it: Sto mostrando messaggi per:

source: and
de_de: und
el_gr: και
it_it: e

source: no messages
de_de: keine Nachrichten
el_gr: δεν υπάρχουν μηνύματα
it_it: nessun messaggio

source: Other apps
de_de: Andere apps
it_it: Altre app

source: Allergies
de_de: Allergien
el_gr: Αλλεργίες
it_it: Allergie

source: Labs
de_de: Laborwerte
el_gr: Εργαστήρια
it_it: Esami di laboratorio

source: Recommender
de_de: Gesundheitsinformationssammlung
el_gr: Αναζήτηση

source: Psycho-emotional questionnaires
de_de: Psycho-emotionaler Fragebogen
el_gr: Ψυχο-συναισθηματική Ενδυνάμωση
it_it: Profilo psico-emotivo

source: Import
de_de: Importieren
el_gr: Εισαγωγή
it_it: Importa

source: Drugs
de_de: Medikamente
it_it: Farmaci

source: Measurements
de_de: Messungen
el_gr: Μετρήσεις
it_it: Misurazioni

source: App Settings for
de_de: App Einstellungen für
el_gr: Ρυθμίσεις εφαρμογών για
it_it: Impostazioni app per:

source: In most cases, an application should be shared with all of your carenets. You can limit your carenets' access by choosing which data to share with them. Sometimes, you may want to restrict an application to only some of your carenets when the application itself, i.e. "My Pregnancy Manager," reveals information you want to keep private.
de_de: In den meisten Fällen sollte eine Anwendung mit allen Ihren Versorgungsnetzwerken geteilt werden. Sie können den Zugang zur Ihren Versorgungsnetzwerken limitieren, in dem Sie angeben, welche Daten geteilt werden sollen. In manchen Fällen macht es Sinn den Austausch auf wenige Versorgungsnetzwerke zu limitieren, wie beispielsweise in der Anwendung Schwangerschafts- Manager
el_gr: Στις περισσότερες περιπτώσεις μία εφαρμογή πρέπει να διαμειράζεται με όλες τις ομάδες σας. Μπορείτε να μειώσετε την πρόσβαση τών ομάδων σας με το να διαλέξετε ποια δεδομένα θέλετε να μοιράζεστε μαζί τους. Μερικές φορές μπορεί να θελήσετε να μοίραστείτε μία εφαρμογή με συγκεκριμένες ομάδες οτάν για παράδειγμα αυτή η εφαρμογη περιέχει πληροφορίες που θέλετε να κρατήσετε προσωπικές.
it_it: Nella maggior parte dei casi, un'applicazione dovrebbe essere condivisa con tutti i tuoi carenet. Puoi limitare l'accesso dei tuoi carenet scegliendo quali dati condividere con loro. In alcuni casi, potresti decidere di limitare un'applicazione solo ad alcuni dei tuoi carenet quando la presenza delle applicazioni di per sè rivela informazioni che vuoi mantenere confidenziali, ad esempio "My Pregnancy Manager.

source: Loading apps
de_de: Lade Apps
el_gr: Φόρτωση εφαρμογών
it_it: Sto caricando le applicazioni

source: Drag the apps to the carenets you want them to be accessible from
de_de: Ziehe die Apps zu den Versorgungsnetzwerken, um sie von dort aus zu erreichen
el_gr: Σείρετε τις εφαρμογές στις ομάδες που θέλετε να είναι διαθέσιμες για
it_it: Trascina le applicazioni sui carenet se vuoi renderle accessibili da

source: Create a new record
de_de: Neuen Datensatz anlegen
el_gr: Δημιουργία νέου φακέλου ασθενούς
it_it: Crea un nuovo record

source: This is your current personal information
de_de: Dies sind Ihre aktuellen persönlichen Informationen
el_gr: Αυτές είναι οι προσωπικές σας πληροφορίες
it_it: Queste sono le tue informazioni personali attuali

source: Edit your information
de_de: Ihre Informationen bearbeiten
el_gr: Επεξεργαστείτε τις πληροφορίες σας
it_it: Modifica i tuoi dati

source: 1 year
de_de: 1 Jahr
el_gr: 1 χρόνος
it_it: 1 anno

source: years
de_de: Jahre
el_gr: χρονών
it_it: anni

source: old
de_de: alt

source: Social Security Number:
de_de: Sozialversicherungsnummer:
it_it: Numero tessera sanitaria

source: Preferred language:
de_de: Bevorzugte Sprache:
el_gr: Προτειμόμενη γλώσσας:
it_it: Lingua preferita

source: no address on file
de_de: Keine Adresse in der Datei
el_gr: δεν υπάρχει διεύθυνση στο αρχείο
it_it: Non è stato fornito alcun indirizzo

source: Your personal information has not yet been stored
de_de: Ihre persönlichen Informationen wurden noch nicht gespeichert
el_gr: Οι προσωπικές σας πληροφορίες δεν έχουν ακόμα αποθηκευτεί
it_it: I tuoi dati personali non sono stati ancora salvati

source: Shared Applications
de_de: Gemeinsame Anwendungen
it_it: Farmaco

source: Update Information
de_de: Informationen erneuern
el_gr: Ανανέωση πληροφοριών
it_it: Aggiorna informazioni

source: Your personal information
de_de: Ihre perönlichen Informationen
el_gr: Οι προσωπικές σας πληροφορίες
it_it: I tuoi dati personali

source: Prefix
de_de: Präfix
el_gr: Τίτλος προ του ονόματος
it_it: Prefisso

source: Given Name
de_de: Vorname
el_gr: Όνομα
it_it: Nome

source: Middle Name
de_de: zweiter Vorname
el_gr: Μεσσαίο όνομα

source: Not Specified / Other
de_de: Nicht spezifiziert / Sonstige
el_gr: Άλλο
it_it: Non specificato/altro

source: Birthday
de_de: Geburtstag
el_gr: Ημερομηνία γέννησης
it_it: Compleanno

source: dd
de_de: tt
el_gr: μερα
it_it: gg

source: day
de_de: Tag
el_gr: μέρα
it_it: giorno

source: month
de_de: Monat
el_gr: μήνας
it_it: mese

source: yyyy
de_de: JJJJ
el_gr: χρόνος
it_it: aaaa

source: year
de_de: Jahr
el_gr: χρόνος
it_it: anno

source: Ethnicity
de_de: Volkszugehörigkeit
el_gr: Εθνικότητα
it_it: Etnia

source: Race
de_de: Rasse
el_gr: Φυλή

source: your preferred language
de_de: Ihre bevorzugte Sprache
el_gr: προτειμόμενη γλώσσα
it_it: La tua lingua preferita

source: Phone 1
de_de: Telefonnummer
el_gr: Τηλέφωνο 1
it_it: Telefono 1

source: Home
de_de: Zuhause
el_gr: Κατοικία
it_it: Casa

source: Work
de_de: Arbeit
el_gr: Εργασία
it_it: Lavoro

source: Cell
de_de: Handy
el_gr: Κελί
it_it: Cellulare

source: Preferred
de_de: Bevorzugt
el_gr: Προτειμόμενη
it_it: Preferito

source: Phone 2
de_de: Alternative Telefonnummer
el_gr: Τηλέφωνο 2
it_it: Telefono 2

source: ZIP Code
de_de: PLZ
el_gr: Ταχυδρομικός κώδικας
it_it: CAP

source: State
de_de: Bundesland
el_gr: Νομός
it_it: Stato

source: * Birthday is a required field
de_de: * Geburtstag ist ein Pflichtfeld
el_gr: * Η ημερομονία γέννησης είναι απαραίτητο πεδίο
it_it: * Compleanno è un campo obbligatorio

source: Hello
de_de: Hallo
el_gr: Γεια σας
it_it: Salve

source: Loading personal information...
de_de: Lade persönliche Informationen.......
el_gr: Φόρτωση προσωπικων πληροφορίων...
it_it: Sto caricando i dati personali
