Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: iPHR-FORTH's extensions
de_de: iPHR-FORTH's Erweiterungen
el_gr: iPHR-FORTH's επεκτάσεις
it_it: Estensioni iPHR-FORTH

source: Records
de_de: Datensätze
el_gr: Φάκελοι
it_it: Cartelle

source: Authorize Record
de_de: Autorisiere Datensatz
el_gr: Επιβεβαίωση φακέλου
it_it: Autorizza cartella clinica

source: Authorize
de_de: Autorisiere
el_gr: Επιβεβαίωση
it_it: Autorizza

source: Go back
de_de: Zurück
el_gr: Επιστροφή
it_it: Torna indietro

source: Logout
de_de: Abmelden
el_gr: Έξοδος
it_it: Disconnetti

source: Indivohealth-FORTH's extensions
de_de: Indivohealth-FORTH's Erweiterungen
el_gr: Indivohealth-FORTH's επεκτάσεις
it_it: Estensioni Indivohealth-FORTH

source: Change Password
de_de: Passwort ändern
el_gr: Αλλαγή κωδικού
it_it: Cambia password

source: Choose a new password
de_de: Neues Passwort wählen
el_gr: Εισάγετε ένα νέο κωδικό
it_it: Scegli una nuova password

source: Old Password:
de_de: Altes Passwort:
el_gr: Παλιός κωδικός:
it_it: Vecchia password:

source: New Password:
de_de: Neues Passwort:
el_gr: Νέος κωδικός
it_it: Nuova password:

source: Set New Password
de_de: Neues Passwort setzten
el_gr: Εισάγετε νέο κωδικό
it_it: Imposta nuova password

source: Go to login
de_de: Zur Anmeldung
el_gr: Επιστροφή στην σελίδα σύνδεσης
it_it: Vai al login

source: Delete account
de_de: Account löschen
el_gr: Διαγραφή Λογαριασμού
it_it: Elimina account

source: H2020 Research Project + Patient Empowerment + Self Management for Cancer deseases
de_de: H2020 Forschungsprojekt + Patienten-Ermächtigung + Eigenmanagement für Krebserkrankungen
it_it: Progetto di Ricerca H2020 – Patient Empowerment e Self-management nelle malattie oncologiche

source: Intelligent Health Lab
de_de: Intelligentes Gesundheitslabor

source: Children&rsquo;s Hospital Informatics Program
de_de: Kinderkrankenhaus Informatik Programm

source: FORTH Institute of computer science
de_de: FORTH Institut für Computerwissenschaften

source: Children&rsquo;s Hospital Boston
de_de: Kinderkrankenhaus Boston

source: Contact us at <a href="mailto:Support@genepartnership.org" style="color: #999">Support@genepartnership.org</a>
de_de: Kontakt <a href="mailto:Support@genepartnership.org" style="color: #999">Support@genepartnership.org</a>
el_gr: Επικοινωνήστε μαζί μας στο <a href="mailto:Support@genepartnership.org" style="color: #999">Support@genepartnership.org</a>

source: Powered by the INDIVO Personally Controlled Health Record
de_de: Unterstützt von INDIVO Personally Controlled Health Record
el_gr: Δημιουργήθηκε απο INDIVO Personally Controlled Health Record

source: Forgot Password
de_de: Passwort vergessen
el_gr: Ξεχάσατε τον κωδικό σας
it_it: Hai dimenticato la password?

source: You can try to initialize your account here
de_de: Sie können versuchen, Ihr Konto hier zu initialisieren
el_gr: Μπορείτε να αρχικοποιήσετε τον λογαριασμό σας εδώ
it_it: Puoi inizializzare il tuo account qui

source: 1. Check your email and click the reset link provided
de_de: 1. Überprüfen Sie Ihre E-Mail und klicken Sie auf den vorgesehenen Link zum Zurücksetzen
el_gr: 1. Ελέγξτε το ηλεκτρονικό ταχυδρομείο σας και πατήστε τον σύνδεσμο επαναφοράς
it_it: Controlla la tua posta elettronica e clicca sul link di reset che ti è stato inviato

source: 2. Enter the following confirmation code:
de_de: 2. Geben Sie den folgenden Bestätigungs Code ein:
el_gr: 2. Εισάγετε τον παρακάτω κώδικο επιβεβαίωσης
it_it: Inserisci il seguente codice di conferma:

source: Check your email and click the reset link provided
de_de: Überprüfen Sie Ihre E-Mail und klicken Sie auf den vorgesehenen Link zum Zurücksetzen
el_gr: Ελέγξτε το ηλεκτρονικό ταχυδρομείο σας και πατήστε τον σύνδεσμο επαναφοράς
it_it: Controlla la tua posta elettronica e clicca sul link di reset che ti è stato inviato

source: To reset your password, enter your account ID (email) below:
de_de: Um Ihr Passwort zurückzusetzten, geben Sie Ihre Account ID ein:
it_it: Per reimpostare la password, inserisci il tuo ID account qui sotto:

source: Back to login
de_de: Zurück zur Anmeldung
el_gr: Επιστροφή στην σελίδα σύνδεσης
it_it: Ritorna al login

source: Password reset instructions will be sent to your contact email
de_de: Die Anleitung zum Zurücksetzen ihres Passworts wird an Ihre Kontakt E-Mail gesendet
el_gr: Οδηγίες για την επαναφορά του κωδικού σας θα σταλούν στο email σαςΟι οδηγίες επαναφοράς του κωδικού σας θα σταλθούν στην ηλεκτρονική σας διεύθυνση
it_it: Le indicazioni per reimpostare la password saranno inviate alla tua casella di posta

source: Send Instructions
de_de: Anleitung senden
el_gr: Αποστολή οδηγιών
it_it: Invia istruzioni reset

source: 'A questionnaire used to monitor psychological, cognitive, emotional and psychosocial aspects.'
de_de: 'Ein Fragebogen, der genutzt wird, um psychische , kognitive, emotionale und psychosoziale Aspekte zu überwachen.'
el_gr: 'Ερωτηματολόγιο για την καταγραφή των ψυχολογικών, συναισθηματικών και ψυχοκοινωνικών πτυχών'
it_it: 'Un questionario per monitorare gli aspetti cognitivi, emotivi e psicosociali'

source: 'Import medications, allergies, problems, procedures and medications providing csv source files.'
de_de: 'Importiert Medikationen, Allergien, Probleme und Prozeduren anhand von csv Quelldateien.'
el_gr: 'Εισαγωγή αλλεργιών, προβλημάτων, επεμβάσεων και φαρμάκων με csv αρχεία'
it_it: 'Importare medicinali, allergie, problemi ed interventi utilizzando file di origine in formato csv.'

source: 'Allow patients to search in a high-quality document repository for useful information.'
de_de: 'Erlaubt Patienten in einer hochwertigen Dokumenten Sammlung zu suchen, um hilfreiche Informationen zu erhalten.'
el_gr: 'Επιτρέπει στους ασθενείς την αναζήτηση σε επιλέγμενα ιατρικά αρχεία'
it_it: 'Fornisce ai pazienti uno strumento di ricerca all’interno di un archivio di documenti affidabili e di qualità verificata.'

source: 'View and update abnormal reactions to encountered allergens.'
de_de: 'Anzeigen und aktualisieren von abnormalen Reaktionen, die auf Allergene zurückzuführen sind. '
el_gr: 'Εισαγωγή αντιδράσεων για την αντιμετώπιση των αλλεργιών'
it_it: 'Visualizzare ed aggiornare le informazioni su reazioni anomale agli allergeni.'

source: 'A timeline view of all available information showing medications, problems, appointments and procedures.'
de_de: 'Eine Zeitachsenansicht aller vorhandenen Informationen über Medikationen, Probleme, Termine und Prozeduren.'
el_gr: 'Ημερολόγιο για την εμφάνιση των πληροφοριών τν φαρμάκων, των προβλημάτων, των ραντεβού και των επεμβάσεων.'
it_it: 'Visualizzazione cronologica di tutte le infomazioni disponibili, come farmaci, problemi, appuntamenti e interventi.'

source: 'View and update laboratory result values.'
de_de: 'Anzeigen und aktualisieren von Labor Ergebnissen.'
el_gr: 'Εισαγωγή και εμφάνιση των αποτελεσμάτων των εργαστηριακών τιμών'
it_it: 'Esami di laboratorio'

source: 'View and update medical treatments or operations of the patient.'
de_de: 'Anzeigen und aktualisieren von medizinischen Behandlungen oder Operationen des Patienten.'
el_gr: 'Εμφάνιση και εισαγωγη επεμβάσεων του ασθενούς'
it_it: 'Visualizzare ed aggiornare i trattamenti medici o gli interventi chirurgici del paziente.'

source: 'View and update drugs or other substances received.'
de_de: 'Anzeigen und aktualisieren von verabreichten Medikamenten oder anderen Substanzen.'
el_gr: 'Εμφάνιση και εισαγωγή των φαρμάκων του ασθενούς'
it_it: 'Visualizzare ed aggiornare i farmaci o altre sostanza assunte.'

source: 'View and update diseases, illnesses, injuries, physiologic, mental or psychological condition or disorders.'
de_de: 'Anzeigen und aktualisieren von Krankheiten, Krankheitsbildern, Verletzungen sowie physiologischen, geistigen oder seelischen Zuständen oder Störungen.'
el_gr: 'Εμφάνιση και εισαγωγή των ασθενειών, τραυματισμών και των ψυχολογικων προβλημάτων του ασθενούς'
it_it: 'Visualizzare ed aggiornare le informazioni sulle patologie e le malattie, le lesioni, le condizioni o i disordini di tipo fisiologico o psicologico.'

source: 'View and update appointments between the patient and doctors.'
de_de: 'Anzeigen und aktualisieren von Terminen zwischen Patient und Ärzten.'
el_gr: 'Εμφάνιση και εισαγωγή των ραντεβού του ασθενούς'
it_it: 'Visualizzare ed aggiornare gli appuntamenti medico-paziente.'

source: 'A form to communicate with other users of the system.'
de_de: 'Ein Formular, das eine Kommunikation zu anderen Benutzern dieses Systems ermöglicht.'
el_gr: 'Φορμα εποικοινω΄νίας με άλλους χρήστες του συστήματος'
it_it: 'Un form per comunicare con gli altri utenti del sistema.'

source: 'View and update patient information such as gender, date of birth, contact information, name and surname.'
de_de: 'Anzeigen und aktualisieren von Patienteninformationen wie beispielsweise Geschlecht, Geburtsdatum, Kontaktinformationen, Vor- und Nachname.'
el_gr: 'Εμφάνιση και εισαγωγή των πληροφοριών του ασθενούς οπως το φύλλο, την ημερομήνια γεννησης, πληροφοριες επικοινωνίας, ονομα και επώνυμο'
it_it: 'Visualizzare ed aggiornare le informazioni del paziente come nome e cognome, data di nascita, sesso, recapiti'

source: 'Add or remove high-quality documents to be further indexed, annotated and become searchable by the patients.'
de_de: 'Hinzufügen oder Löschen von hochwertigen Dokumenten, die indexiert, annotiert und suchbar für Patienten werden.'
el_gr: 'Εισαγωγή ιατρικών κειμένων για περαιτέρω επεξεργασία και για να χρησιμοποιηθούν στις αναζητήσεις των ασθενών'
it_it: 'Aggiungere o rimuoveredocumenti di alta qualità, al fine di indicizzarli, annotarli e renderli fruibili per i pazienti'

source: 'View and update vital signs that indicate the status of the body’s vital functions.'
de_de: 'Anzeigen und aktualisieren von Vitalzeichen die auf den Zustand der Körperfunktionen hindeuten.'
el_gr: 'Εμφάνιση και εισαγωγη των ζωτικων μέτρησεων του ασθενούς'
it_it: 'Visualizzare ed aggiornare i segni vitali che indicano lo stato delle funzioni vitali corporee'

source: 'Assess graphically the psycho-emotional patient profile.'
de_de: 'Grafisches Beurteilen der psycho-emotionalen Profile verschiedener Patienten'
el_gr: 'Εμφάνιση γραφημάτων για το ψυχολογικο προφιλ του ασθενούς'
it_it: 'Visualizzare graficamente il profilo psico-emotivo del paziente.'

source: 'Assess graphically the psycho-emotional profile of different patients.'
de_de: 'Grafisches Beurteilen der psycho-emotionalen Profile verschiedener Patienten'
el_gr: 'Εμφάνιση γραφικών με το ψυχολογικο προφίλ διαφορετικών ασθενών'
it_it: 'Visualizzazione grafica del profilo psico-emotivo di diversi pazienti.'

source: 'A profile tool to assess the psycho-emotional status and recommend educational resources related to your condition and assist your in order to make informed decisions regarding your healthcare'
de_de: 'Ein Profilwerkzeug, um den psycho-emotionalen Zustand einzuschätzen, Bildungsressourcen abhängig vom Zustand vorzuschlagen und zu assistieren, um sachkundige Entscheidungen bezüglich Ihrer Gesundheitsversorgung zu treffen. '
it_it: 'Uno strumento di profiling per esaminare lo stato psico-emotivo del paziente, suggerire risorse educative relative alla tua condizione e assisterti in modo da prendere decisioni informate riguardo alla tua salute'

source: 'psycho-emotional questionnaires'
de_de: 'Psycho-emotionaler Fragebogen'
it_it: 'Profilo psico-emotivo'

source: 'Forum is a mechanism within the platform to enable information exchange among participants.'
de_de: 'Das Forum der Plattform macht den Informationsaustausch zwischen den Patienten möglich.'
el_gr: 'Το φόρουμ βοηθάει στην ανταλλαγή πληροφοριών ανάμεσα στους ασθενείς.'
it_it: 'Il Forum è un meccanismo della piattaforma che permette lo scambio di informazioni tra i partecipanti.'

source: 'Connect to serious games platform'
de_de: 'Mit der Plattform für Seriöse Spiele verbinden'
el_gr: 'Σύνδεση με την πλατφόρμα των serious games'
it_it: 'Connettersi alla piattaforma dei serious games'

source: 'Upload your health data documents.'
de_de: 'Laden Sie Ihre Gesundheitsdokumente hoch.'
el_gr: 'Φόρτωση αρχείων με τις ιατρικές σας πληροφορίες.'
it_it: 'Caricare I documenti sanitari.'

source: 'Upload your health data documents'
de_de: 'Laden Sie Ihre Gesundheitsdokumente hoch'
el_gr: 'Φόρτωση αρχείων με τις ιατρικές σας πληροφορίες.'
it_it: 'Caricare I documenti sanitari.'

source: ' Description '
de_de: 'Beschreibung '
it_it: ' Descrizione '

source: ' Help for '
de_de: 'Hilfe für '
el_gr: 'Βοήθεια για '
it_it: ' Assistenza per '

source: ' Please leave some feedback for this Medication '
de_de: 'Bitte geben Sie ein Feedback zu dieser Medikation'
it_it: 'Per favore, lascia un feedback per questo medicinale'

source: ' Add New Administrator'
de_de: 'Neuen Administrator hinzufügen'
el_gr: 'Εισαγωγή νέου διαχειριστή'
it_it: 'Aggiungi un nuovo Amministratore'

source: Message will be sent!
de_de: Nachricht wird versendet!
el_gr: Το μήνυμα θα αποσταλλεί
it_it: Il messaggio verrà inviato!

source: 'Send Message'
de_de: 'Nachricht schreiben'
el_gr: 'Αποστολή μηνύματος'
it_it: 'Invia messaggio'

source: Subject
de_de: Betreff
el_gr: Θέμα
it_it: Oggetto

source: Type your message
de_de: Geben Sie Ihre Nachricht ein
el_gr: Γράψτε το μηνυμά σας
it_it: Corpo del messaggio:

source: Send Message
de_de: Nachricht senden
el_gr: Αποστολή μήνυματος
it_it: Invia Messaggio

source: Demographics
de_de: Demographie
el_gr: Δημογραφικά
it_it: Informazioni socio-demografiche

source: demographics
de_de: Demographie
el_gr: Δημογραφικά
it_it: Informazioni socio-demografiche

source: ' iPHR Validation Questionnaire '
de_de: ' iPHR Validierungs Fragebogen '
it_it: 'Questionario di validazione iPHR'

source: Born
de_de: Geboren
el_gr: Γεννήθηκε
it_it: Nato

source: Select a Patient
de_de: Patient auswählen
el_gr: Επίλεξε ενα ασθενή
it_it: Seleziona un paziente

source: Add Patient
de_de: Patient hinzufügen
el_gr: Εισαγωγή ασθενή
it_it: Aggiungi Paziente

source: ' Select a Patient '
de_de: 'Patient auswählen'
el_gr: 'Επίλεξε ενα ασθενή'
it_it: 'Seleziona un Paziente'

source: Loading
de_de: Laden
el_gr: Φόρτωση
it_it: Sto caricando le applicazioni

source: Patients
de_de: Patienten
el_gr: Ασθενείς
it_it: Pazienti

source: Settings
de_de: Einstellungen
el_gr: Ρυθμίσεις
it_it: Impostazioni

source: Inbox
de_de: Posteingang
el_gr: Εισερχόμενα
it_it: Posta in arrivo

source: Admin Console
de_de: Administratorkonsole
it_it: Console Admin

source: Language
de_de: Sprache
el_gr: Γλώσσα
it_it: Lingua

source: iPHR Validation Questionnaire
de_de: iPHR Validierungs Fragebogen
el_gr: Ψυχο-συναισθηματική Ενδυνάμωση
it_it: Questionario di validazione iPHR

source: About iPHR
de_de: Über iPHR
el_gr: Πληροφορίες
it_it: Informazioni

source: Loading records...
de_de: Lade Datensätze...
el_gr: Φόρτωση φακέλων
it_it: Carico le cartelle cliniche...

source: Sharing
de_de: Teilen
el_gr: Κοινή χρήση
it_it: Condivisione

source: App Settings
de_de: App Einstellungen
el_gr: Ρυθμίσεις εφαρμογής
it_it: Impostazioni applicazione

source: Welcome to
de_de: Willkommen zu
el_gr: Καλωσήρθατε στο
it_it: Benvenuto su

source: Username:
de_de: Benutzername:
el_gr: Ψευδώνυμο:
it_it: Nome utente:

source: Password
de_de: Passwort
el_gr: Κωδικός

source: Forgot your password?
de_de: Passwort vergessen?
el_gr: Ξεχάσατε τον κωδικό σας;
it_it: Hai dimenticato la password?

source: No account? Register here
de_de: Keinen Account? Hier registrieren
el_gr: Δεν έχετε λογαριασμό; Εγγραφείτε εδώ
it_it: Non hai un account? Registrati qui

source: ' Report a problem '
de_de: ' Problem melden '
el_gr: 'Αναφέρετε ένα πρόβλημα'
it_it: 'Riferisci un problema'

source: Forgot your password/username?
de_de: Passwort vergessen/benutzername?
el_gr: Ξεχάσατε τον κωδικό ή το όνομα χρήστη;
it_it: Hai dimenticato la password?

source: Report a problem
de_de: Problem melden
el_gr: Αναφέρετε ενα πρόβλημα
it_it: Riferisci un problema

source: Create Record
de_de: Erzeuge Datensatz
el_gr: Δημιουργία φακέλου
it_it: Crea una cartella

source: Adding records has been disabled by the administrator
de_de: Das Hinzufügen von Datensätzen wurde vom Administrator deaktiviert
el_gr: Η εισαγωγή φακέλων απενεργοποιήθηκε για τους διαχειριστές
it_it: L΄aggiunta di cartelle è stata disabilitata dall'amministratore

source: Record Name:
de_de: Name des Datensatzes:
el_gr: Όνομα φακέλου
it_it: Nome cartella

source: You can change this name any time
de_de: Sie können diesen Namen jederzeit ändern
el_gr: Μπόρειτε να αλλάξετε αυτό το όνομα οποιάδηποτε στιγμή
it_it: Puoi cambiare il nome in qualunque momento

source: Go to my account
de_de: Gehe zum meinem Account
el_gr: Επιστρογή στον λογαριασμό μου
it_it: Vai al mio account

source: Select Record
de_de: Datensatz auswählen
el_gr: Επιλογή φακέλου
it_it: Seleziona cartella

source: This account has no records
de_de: Dieser Account hat keine Datensätze
el_gr: Αυτός ο λογαριασμός δεν έχει φακέλους
it_it: Questo account non contiene cartelle

source: Add a Record
de_de: Datensatz hinzufügen
el_gr: Εισαγωγή φακέλου
it_it: Aggiungi una cartella

source: Registration
de_de: Registrierung
el_gr: Εγγραφή
it_it: Registrazione

source: Register for
de_de: Registrieren für
el_gr: Εγγραφή για
it_it: Registrati per

source: Received no activation email?
de_de: Haben Sie keine Aktivierungs-E-Mail erhalten?
el_gr: Δεν λάβατε ηλεκτρονικό μήνυμα ενεργοποίησης;
it_it: Non hai ricevuto la mail di attivazione?

source: Your Name:
de_de: Ihr Name:
el_gr: Το ονομά σας:
it_it: Il tuo nome:

source: Your place of residence:
de_de: Ihr Wohnsitz:
it_it: La tua residenza:

source: Companion
de_de: Begleiter
el_gr: Φύλακας

source: Research project
de_de: Forschungsprojekt
el_gr: Ερευνητικό πρόγραμμα
it_it: Progetto di ricerca

source: I am a...
de_de: Ich bin ein(e)
it_it: Sono

source: Companion of a Patient
de_de: Begleiter eines Patienten
it_it: Compagno di un paziente

source: Medical Doctor
de_de: Mediziner
it_it: Medico

source: Researcher
de_de: Forscher
it_it: Ricercatore

source: Cancer information
de_de: Krebsinformation
el_gr: Πληροφορίες για τον καρκίνο
it_it: Aggiorna informazioni

source: Cancer type
de_de: Krebstyp
it_it: Localizzazione del tumore

source: Select
de_de: Auswählen
it_it: Seleziona cartella

source: Breast cancer
de_de: Brustkrebs
it_it: Tumore al seno

source: Bladder cancer
de_de: Blasenkrebs
it_it: Tumore alla vescica

source: Lung cancer
de_de: Lungenkrebs
it_it: Tumore al polmone

source: Brain cancer
de_de: Hirntumor
it_it: Tumore cerebrale

source: MelanomaBreast cancer
de_de: Melanombrustkrebs
it_it: Tumore al seno

source: Non-Hodgkin lymphoma
de_de: Non-Hodgkin Lymphom
it_it: Linfoma Non-Hodgkin

source: Cervical cancer
de_de: Gebärmutterhalskrebs
it_it: Tumore alla cervice uterina

source: Ovarian cancer
de_de: Eierstockkrebs
it_it: Tumore ovarico

source: Colorectal cancer
de_de: Dickdarmkrebs
it_it: Tumore al colon-retto

source: Pancreatic cancer
de_de: Bauchspeicheldrüsenkrebs
it_it: Tumore al pancreas

source: Esophageal cancer
de_de: Speiseröhrenkrebs
it_it: Tumore esofageo

source: Prostate cancer
de_de: Prostatakrebs
it_it: Tumore alla prostata

source: Kidney cancer
de_de: Nierenkrebs
it_it: Tumore al rene

source: Skin cancer
de_de: Hautkrebs
it_it: Tumore alla pelle

source: Leukemia
de_de: Leukämie
it_it: Leucemia

source: Thyroid cancer
de_de: Schilddrüsenkrebs
it_it: Tumore alla tiroide

source: Liver cancer
de_de: Leberkrebs
it_it: Tumore al fegato

source: Uterine cancer
de_de: Gebärmutterkrebs
it_it: Tumore all’utero

source: Sharing preferences
de_de: Präferenzen teilen
el_gr: Προτιμήσεις για τον διαμοιρασμό
it_it: Condividi con

source: Yes, I agree that my health data is used for research of any kind after proper anonymization
de_de: Ja, ich bin damit einverstanden, dass meine Gesundheitsdaten nach ordnungsgemäßer Anonymisierung zu jeder Art von Forschung genutzt werden
el_gr: Ναι, θα ήθελα τα ιατρικα μου δεδομένα να χρησιμοποιηθούν για έρευνα μετά από ολοκληρωμένη ανωνυμοποιήση
it_it: Sì, acconsento che i miei dati siano utilizzati a scopo di ricerca di qualunque genere dopo essere stati appropriatamente anonimizzati

source: No, I do not wish to provide my data for research project
de_de: Nein, ich möchte meine Daten nicht den Forschungsprojekten zur Verfügung stellen.
el_gr: Όχι, δεν θα ήθελα να παρέχω τα δεδομένα μου για έρευνα
it_it: No, non voglio rendere disponibili i miei dati per progetti di ricerca

source: I want to decide about this individually for each planned research project
de_de: Ich möchte für jedes Forschugsprojekt separat darüber entscheiden.
el_gr: Θα ήθελα να αποφασίσω για κάθε έρευνα ξεχωριστά
it_it: Voglio decidere a seconda del singolo progetto di ricerca

source: Speciality
de_de: Fachgebiet
el_gr: Ειδικότητα
it_it: Specializzazione

source: Full name of health organisation
de_de: Vollständiger Name der Gesundheitseinrichtung
el_gr: Όνομα οργανισμού
it_it: Nome dell’organizzazione

source: Full address of your organisation
de_de: Vollständige Adresse der Einrichtung
el_gr: Διεύθυνση οργανισμού
it_it: Indirizzo dell’organizzazione

source: A confirmation code will be sent here
de_de: Ein Bestätigungscode wird hierhin gesendet
el_gr: Ένας κωδικός επιβεβαίωσης θα σταλεί εδώ
it_it: Un codice di conferma verrà inviato qui

source: Register
de_de: Registrieren
el_gr: Εγγραφή
it_it: Registrati

source: Online registration is not available
de_de: Online Registrierung nicht verfügbar
el_gr: Η εγγραφή μέσω απεύθείας σύνδεσης δεν είναι διαθέσιμη
it_it: La registrazione online non è disponibile

source: Administrator Registration
de_de: Administrator Registrierung
el_gr: Εγγραφή διαχειριστή
it_it: Registrazione Amministratore

source: iPHR - Report a problem
de_de: iPHR - Problem melden
it_it: iPHR – riporta un problema

source: Fullname
de_de: Vollständiger Name
it_it: Cognome

source: Where did the problem appear?
de_de: Wo ist das Problem aufgetreten?
it_it: Quando è comparso il problema?

source: Problem Description
de_de: Problembeschreibung
it_it: Descrizione del problema

source: Required Field.
de_de: Benötigtes Feld.
it_it: Campo obbligatorio

source: Submit Problem
de_de: Problem melden
it_it: Sottometti il Problema

source: Screenshot
de_de: Bildschirmfoto
it_it: Schermata

source: Password Reset
de_de: Password zurücksetzen
el_gr: Επαναφορά κωδικού
it_it: Reimposta password

source: Set Password
de_de: Password setzen
el_gr: Εισαγωγή κωδικού
it_it: Imposta password

source: Account Activation
de_de: Account Aktivierung
el_gr: Ενεργοποιήση λογαριασμού
it_it: Attivazione account

source: Resend Activation
de_de: Erneute Account Aktivierung
el_gr: Επαναποστολή Ενεργοποιήσης
it_it: Invia di nuovo il codice di attivazione

source: Disclaimer
de_de: Haftungsausschluss
el_gr: Προϋποθέσεις

source: Sharing and Audit
de_de: ' Teilen und Prüfen '
el_gr: Διαμοιρασμός και έλεγχος
it_it: Condivisione

source: Share with:
de_de: Teilen mit:
el_gr: Μοιράστηκε με:
it_it: Condividi con:

source: cancel
de_de: Abbrechen
el_gr: άκυρο
it_it: Cancella

source: You need to login first
de_de: Sie müssen sich zuerst anmelden
el_gr: Πρέπει να συνδεθείτε πρώτα
it_it: Devi prima eseguire l'accesso

source: Either the username or password is missing. Please try again.
de_de: Es fehlt entweder der Benutzername oder das Passwort. Bitte versuchen Sie es erneut.
el_gr: Ο κωδικός ή το ψευδώνυμο είναι κενά. Παρακαλω προσπαθήστε ξανά
it_it: Manca il nome utente o la password. Per favore, riprova

source: Incorrect username or password. Please try again.
de_de: Falscher Benutzername oder falsches Passwort. Bitte versuchen Sie es erneut.
el_gr: Λανθασμένο ψευδώνυμο ή κωδικός. Παρακαλώ προσπαθήστε ξανά.
it_it: Nome utente o password non corretti. Per favore, riprova

source: Failed to claim request token
de_de: Fehler beim Anfordern des Request Token
el_gr: Αποτυχία διεκδήκησης διακριτικού αιτήματος
