Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: 90 – Able to carry on normal activity; minor signs or symptoms of disease.
de_de: 90 - In der Lage alltägliche Aktivitäten durchzuführen; geringe Anzeichen oder Symptome von Krankheit.
it_it: 90 - Possibili le normali attività, Sintomatologia molto sfumata.

source: 80 – Normal activity with effort; some signs or symptoms of disease.
de_de: 80 – Normale Aktivität, aber mit Anstrengung; einige Anzeichen oder Symptome von Krankheit.
it_it: 80 - Normali attività possibili con difficoltà. Sintomi evidenti.

source: 70 – Cares for self; unable to carry on normal activity or to do active work.
de_de: 70 – Sorgt für sich selbst; nicht in der Lage normale Aktivitäten durchzuführen oder Arbeit zu verrichten.
it_it: 70 - Cura di se stessi. Normali attività e lavoro non possibili.

source: 60 – Requires occasional assistance, but is able to care for most of their personal needs.
de_de: 60 – Braucht gelegentlich Unterstützung, aber ist in der Lage sich um die meisten persönlichen Bedürfnisse zu kümmern
it_it: 60 - Necessario qualche aiuto, indipendente nei bisogni personali.

source: 50 – Requires considerable assistance and frequent medical care.
de_de: 50 – Braucht erhebliche Unterstützung und häufige medizinische Versorgung.
it_it: 50 - Aiuto spesso necessario, richiede frequenti cure mediche.

source: 40 – Disabled; requires special care and assistance.
de_de: 40 – Sehr eingeschränkt; benötigt spezielle Betreuung und Unterstützung.
it_it: 40 - Disabile. Necessario un aiuto qualificato.

source: 30 – Severely disabled; hospital admission is indicated although death not imminent.
de_de: 30 – Sehr Schwer beeinträchtigt; Aufnahme ins Krankenhaus deutet sich an obwohl der Tod nicht unmittelbar bevorsteht.
it_it: 30 - Severamente disabile. Ospedalizzazione necessaria ma senza rischio di morte.

source: 20 – Very sick; hospital admission necessary; active supportive treatment necessary.
de_de: 20 – Sehr krank; Krankenhausaufenthalt nötig; aktive unterstützende Behandlung nötig.
it_it: 20 - Estremamente malato. Richieste misure intensive di supporto alla vita.

source: 10 – Moribund; fatal processes progressing rapidly.
de_de: 10 – Im Sterben liegend; tödliche Prozesse schreiten schnell voran.
it_it: 10 - Moribondo. Processi di malattia fatali rapidamente progressivi.

source: Dead
de_de: Tot
it_it: Morto

source: Expected outcome
de_de: Erwartetes Ergebnis
it_it: Outcome atteso

source: Greater than 90%% survival probability
de_de: Mehr als 90%% Überlebenswahrscheinlichkeit
it_it: Probabilità di sopravvivenza superiore al 90%

source: less than 30%%
de_de: weniger als 30%%
it_it: meno del 30%%

source: Computer skill of the child
de_de: Computerfähigkeiten des Kindes
it_it: Capacità informatiche del bambino

source: Very good
de_de: Sehr gut
it_it: Molto buone

source: Good
de_de: Gut
it_it: Buone

source: Medium
de_de: Mittel
it_it: Medie

source: Poor
de_de: Schlecht
it_it: Scarse

source: Computer games played by the child
de_de: Von dem Kind gespielte Computerspiele

source: Greater than 6 hours
de_de: Mehr als 6 Stunden

source: 3 – 6 hours
de_de: 3 - 6 Stunden

source: 1-3 hours
de_de: 1 - 3 Stunden

source: Less than 1 hour a day
de_de: Weniger als eine Stunde am Tag

source: Add New Questionnaire
de_de: Neuen Fragebogen hinzufügen
el_gr: Νέο ερωτηματολόγιο
it_it: Aggiungi un nuovo questionario

source: New Problem
de_de: Neues Problem hinzufügen
el_gr: Νέο πρόβλημα
it_it: Nuovo Problema

source: Category
de_de: Kategorie
el_gr: Κατηγορία
it_it: Categoria

source: Primary disease
de_de: Grunderkrankung
el_gr: Βασική ασθένεια
it_it: Patologia principale

source: Co-morbidities
de_de: Nebenerkrankungen
el_gr: Παράπλευρες ασθένειες
it_it: Comorbidità

source: Age of diagnosis
de_de: Diagnosealter
it_it: Età di diagnosi

source: Initial diagnosis
de_de: Erstdiagnose
it_it: Diagnosi iniziale

source: Treatment (multiple answers)
de_de: Behandlung (mehrere Antworten möglich)
it_it: Trattamento (possibili più risposte)

source: Treatment
de_de: Behandlung
it_it: Trattamento

source: Treatment intensity
de_de: Behandlungsintensität
it_it: Intensità del trattamento

source: Treatment duration
de_de: Behandlungsdauer
it_it: Durata del trattamento

source: Treatment:
de_de: Behandlung:
it_it: Trattamento:

source: Treatment intensity:
de_de: Behandlungsintensität:
it_it: Intensità del trattamento:

source: Treatment duration:
de_de: Behandlungsdauer:
it_it: Durata del trattamento:

source: Treatment:
de_de: Behandlung:
it_it: Trattamento:

source: Expected outcome
de_de: Erwartetes Ergebnis
it_it: Outcome atteso

source: Computer skills of the child
de_de: Computerfähigkeiten der Kindes
it_it: Capacità informatiche del bambino

source: Date resolved
de_de: Ende
el_gr: Τελική Ημερομηνία
it_it: Data di risoluzione

source: Edit Cancer Clinical Assessment Questionnaire
de_de: Fragebogen zur klinischen Einschätzung des Krebses bearbeiten
it_it: Modifica Questionario di Assessment Clinico Oncologico

source: Initial diagnosis
de_de: Erstdiagnose
it_it: Diagnosi iniziale

source: Update Questionnaire
de_de: Fragebogen aktualisieren
it_it: Aggiorna Questionario

source: Update questionnaire
de_de: Fragebogen aktualisieren
it_it: Aggiorna Questionario

source: You can use this form in order to communicate with other users in your network (carenets)
de_de: Sie können dieses Formular nutzen, um mit anderen Nutzern in ihrem Netzwerk (Carenet) zu kommunizieren.
it_it: Puoi usare questo form per comunicare con altri utenti del tuo network (carenets)

source: Contact
de_de: Kontaktperson
el_gr: Επικοινωνία
it_it: Contatti

source: Subject:
de_de: Betreff:
el_gr: Θέμα:
it_it: Oggetto:

source: Message:
de_de: Nachricht:
el_gr: Μήνυμα
it_it: Corpo del messaggio:

source: Send
de_de: Senden
el_gr: Αποστολή
it_it: Invia

source: Send an email to the administrator to describe the number and kind of patients that you need to give consent
de_de: Senden Sie eine E-Mail an den Administrator und nennen Sie die Anzahl und Art der Patienten, die eine Einwilligung geben müssen
it_it: Manda un’email all’amministratore per descrivere il numero ed il tipo di pazienti da cui hai bisogno di avere il consenso

source: Upload documents
de_de: Dokumente hochladen
el_gr: Φόρτωση αρχείων
it_it: Carica documenti

source: Open
de_de: Offen
el_gr: Άνοιγμα
it_it: Apri

source: ' Sharing and Audit '
de_de: ' Teilen und Prüfen '
el_gr: 'Διαμοιρασμός και έλεγχος'
it_it: 'Condivisione e Audit'

source: add a document
de_de: Dokument hinzufügen
el_gr: εισαγωγή αρχείου
it_it: Aggiungi un documento

source: deleted documents
de_de: gelöschte Dokumente
el_gr: διεγραμμένα αρχεία
it_it: documenti eliminati

source: Shared with
de_de: Geteilt mit
el_gr: Κοινή χρήση με
it_it: Condiviso con

source: Share
de_de: Teilen
el_gr: Κοινή χρήση
it_it: Condivisione

source: 'Please insert title'
de_de: 'Bitte Titel eintragen'
el_gr: 'Παρακαλώ συμπληρώστε τον τίτλο'
it_it: 'Per favore, inserisci il titolo'

source: 'Please upload document'
de_de: 'Bitte Dokument hochladen'
el_gr: 'Παρακαλώ επιλέξτε κάποιο αρχείο'
it_it: 'Per favore,inserisci la data'

source: New Document
de_de: Neues Dokument
el_gr: Νέο αρχείο
it_it: Nuovo Documento

source: Select a file
de_de: Datei auswählen
it_it: Seleziona un file

source: Organisation
de_de: Einrichtung
it_it: Organizzazione

source: Doctor
de_de: Arzt
el_gr: Γιατρός
it_it: Nome del medico

source: Reasons
de_de: Gründe
it_it: Ragioni

source: Other
de_de: Andere
it_it: Altro

source: Laboratory reports
de_de: Laborbefunde
it_it: Esami di laboratorio

source: Findings
de_de: Ergebnisse
it_it: Risultati

source: Discharge letters
de_de: Entlassungsschreiben

source: Upload
de_de: Hochladen
el_gr: Μεταφόρτωση
it_it: Carica

source: 'Problem must be filled'
de_de: 'Problem muss eingetragen werden'
el_gr: 'Συμπληρώστε το πρόβλημα'
it_it: 'Compilare il campo "Problema"'

source: Update Problem
de_de: Problem aktualisieren
el_gr: Ενημέρωση πληροφοριών προβλήματος
it_it: Aggiorna Problema

source: 'Please fill name'
de_de: 'Bitte Vornamen eintragen'
el_gr: 'Παρακαλώ συμπληρώστε το όνομα'
it_it: 'Per favore, inserisc il nome'

source: 'Please fill family name'
de_de: 'Bitte Namen eintragen'
el_gr: 'Παρακαλώ συμπληρώστε το επίθετο'
it_it: 'Per favore, inserisci il cognome'

source: 'Please fill email'
de_de: 'Bitte E-Mail eintragen'
el_gr: 'Παρακαλώ συμπληρώστε την ηλεκτρονική σας διεύθυνση(email)'
it_it: 'Per favore, inserisci l’indirizzo email'

source: 'Please fill month'
de_de: 'Bitte Monat eintragen'
el_gr: 'Παρακαλώ συμπληρώστε τον μήνα'
it_it: 'Per favore, inserisci il mese'

source: 'Please fill day'
de_de: 'Bitte Tag eintragen'
el_gr: 'Παρακαλώ συμπληρώστε την ημερα'
it_it: 'Per favore, inserisci il giorno'

source: 'Please fill year'
de_de: 'Bitte Jahr eintragen.'
el_gr: 'Παρακαλώ συμπληρώστε το έτος'
it_it: 'Per favore, inserisci l’anno'

source: 'Please enter a realistic value for weight (20 - 200kg).'
de_de: 'Bitte tragen Sie einen realistischen Wert für das Gewicht ein (20-200kg).'
it_it: 'Per favore, inserisci un valore di peso compreso tra 20 e 200 kg'

source: Family Name
de_de: Nachname
el_gr: Επίθετο
it_it: Cognome

source: Social security number
de_de: Sozialversicherungsnummer
el_gr: Αριθμός ασφάλισης
it_it: Numero tessera sanitaria

source: Birth date
de_de: Geburtsdatum
el_gr: Ημερομηνία γέννησης
it_it: Data di nascita

source: Smoking
de_de: Raucher
el_gr: Κάπνισμα
it_it: Fumatore

source: No
de_de: Nein
el_gr: Όχι

source: Yes
de_de: Ja
el_gr: Ναι
it_it: Si

source: Pregnancy
de_de: Schwangerschaft
el_gr: Εγκυμοσύνη
it_it: Gravidanza

source: Weight
de_de: Gewicht
el_gr: Βάρος
it_it: Peso

source: Weight unit
de_de: Gewichtseinheit
el_gr: Μονάδα βάρους
it_it: Unità di misura del peso

source: Update
de_de: Aktualisieren
el_gr: Ενημέρωση
it_it: Aggiorna

source: Family name
de_de: Nachname
el_gr: Επίθετο
it_it: Cognome

source: Date of onset
de_de: Beginn
el_gr: Αρχική ημερομηνία
it_it: Data di insorgenza

source: 'Resolution date must be filled'
de_de: 'Ende muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία λήξης'
it_it: 'Inserire la data di risoluzione'

source: No Results
de_de: Keine Ergebnisse
el_gr: Εμφάνιση αποτελεσμάτων
it_it: Nessun risultato

source: End of Results
de_de: Ende der Ergebnisse
el_gr: Τελεύταια αποτελέσματα
it_it: Fine dei risultati

source: Showing Results
de_de: Ergebnisse anzeigen
el_gr: Εμφάνιση αποτελεσμάτων
it_it: Stai visualizzando i seguenti risultati:

source: Date Measured
de_de: Datum der Messung
el_gr: Ημερομηνία μέτρησης
it_it: Data della misurazione

source: Lab Status
de_de: Laborstatus
el_gr: Κατάσταση εργαστηρίου
it_it: Stato degli esami di laboratorio

source: Lab Test Name
de_de: Name des Labortests
el_gr: Όνομα εξέτασης
it_it: Nome esame di laboratorio

source: Deleted Labs
de_de: Gelöschte Laborwerte
el_gr: Διεγραμμένα εργάστηρια
it_it: Esami eliminati

source: 15 per page
de_de: 15 pro Seite
el_gr: 15 ανά σελίδα
it_it: 15 per pagina

source: 30 per page
de_de: 30 pro Seite
el_gr: 30 ανά σελίδα
it_it: 30 per pagina

source: 50 per page
de_de: 50 pro Seite
el_gr: 50 άνά σελίδα
it_it: 50 per pagina

source: 100 per page
de_de: 100 pro Seite
el_gr: 100 ανά σελίδα
it_it: 100 per pagina

source: With Status
de_de: Mit Status
el_gr: Με κατάσταση
it_it: Con stato

source: All
de_de: Alle
el_gr: Όλα
it_it: Tutti

source: Laboratory Name
de_de: Laborname
el_gr: Εργαστήριο
it_it: Esame

source: Value
de_de: Wert
el_gr: Τιμή
it_it: Valore

source: add lab
de_de: Laborwert hinzufügen
el_gr: εισαγωγή εργαστηρίου
it_it: Aggiungi esame di laboratorio

source: deleted labs
de_de: gelöschte Laborwerte
el_gr: διεγραμμένα εργάστηρια
it_it: Esami di laboratorio eliminati

source: Labs Report
de_de: Laborbericht
el_gr: Eργαστήρια
it_it: Risultato analisi

source: With Status
de_de: Mit Status
el_gr: Με κατάσταση
it_it: Con stato

source: [add lab]
de_de: [Labortest hinzufügen]
el_gr: [εισαγωγή εργαστηρίου]
it_it: [aggiungi esame di laboratorio]

source: [deleted labs]
de_de: [gelöschte Labortests]
el_gr: [διεγραμμένα εργάστηρια]
it_it: [esami di laboratorio eliminati]

source: 'Quantitive result value must be filled'
de_de: 'Messwert muss eingetragen werden'
el_gr: 'Συμπληρώστε το ποσοτικό αποτέλεσμα'
it_it: 'Inserire manualmente il valore'

source: 'Collected at value must be filled'
de_de: 'Datum muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία συλλογής'
it_it: 'Riempire il campo "Eseguito il:" '

source: 'Quantitative result normal range minimum value must be filled'
de_de: 'Unterer Wert des Normbereichs muss eingetragen werden'
el_gr: 'Συμπληρώστε την ελάχιστη τιμή φυσιολογικού αποτελέσματος'
it_it: 'Inserire il valore minimo di riferimento'

source: 'Quantitative result normal range maximum value must be filled'
de_de: 'Oberer Wert des Normbereichs muss eingetragen werden'
el_gr: 'Συμπληρώστε την μέγιστη τιμή φυσιολογικού αποτελέσματος'
it_it: 'Inserire il valore massimo di riferimento'

source: 'Test name title must be filled'
de_de: 'Testname muss eingetragen werden'
el_gr: 'Συμπληρώστε τον τίτλο του εργαστηρίου'
it_it: Aggiungere il nome dell'esame

source: New Lab
de_de: Neuer Labortest
el_gr: Νέο εργαστήριο
it_it: Nuovo esame

source: Abnormal interpretation
de_de: abnormales Testergebnis
el_gr: Ερμηνεία
it_it: Interpretazione dei valori anomala

source: Critical
de_de: Kritisch
el_gr: Κρίσιμο
it_it: Critico

source: Abnormal
de_de: Ungewöhnlich
el_gr: Μη φυσιολογικό
it_it: Anormale

source: Accession number
de_de: Zugangsnummer
el_gr: Αριθμός
it_it: Numero di collocazione

source: Correction
de_de: Korrektur
el_gr: Διόρθωση
it_it: Correzione

source: Preliminary
de_de: Vorläufig
el_gr: Προκαταρκτική
it_it: Preliminare

source: Final
de_de: Abgeschlossen
el_gr: Τελική
it_it: Finale

source: Notes
de_de: Notizen
el_gr: Σημειώσεις
it_it: Note

source: Collected at
de_de: Probenentnahmedatum
el_gr: Συλλέχθηκε στις
it_it: Eseguito il:

source: Quantitative result normal range max value
de_de: Oberer Wert des Normbereichs
el_gr: Μέγιστη τιμή φυσιολογικού αποτελέσματος
it_it: Valore massimo del range normativo

source: Quantitative result normal range max unit
de_de: Einheit für die obere Grenze des Normbereiches
el_gr: Μονάδα μέτρησης μέγιστης τιμής φυσιολογικού αποτελέσματος
it_it: Unità di misura del valore massimo del range normativo

source: Quantitative result normal range min value
de_de: Unterer Wert des Normbereichs
el_gr: Ελάχιστη τιμή φυσιολογικού αποτελέσματος
it_it: Valore minimo del range normativo

source: Quantitative result normal range min unit
de_de: Einheit für die untere Grenze des Normbereiches
el_gr: Μονάδα μέτρησης ελάχιστης τιμής φυσιολογικού αποτελέσματος
it_it: Unità di misura del valore minimo del range normativo

source: Quantitative result value
de_de: Messwert
el_gr: Τιμή αποτελέσματος
it_it: Valore numerico risultato

source: Quantitative result unit
de_de: Einheit
el_gr: Μονάδα μέτρησης αποτελέσματος
it_it: Unità di misura risultato

source: Quantitative result non critical range max value
de_de: Oberer Wert des unkritischen Bereichs
el_gr: Μη κρίσιμη μέγιστη τιμή αποτελέσματος
it_it: Valore massimo range non critico

source: Quantitative result non critical range max unit
de_de: Einheit für die obere Grenze des nicht kritischen Bereiches
el_gr: Μονάδα μέτρησης μη κρίσιμης μέγιστης τιμής αποτελέσματος
it_it: Unità di misura valore massimo range non critico

source: Quantitative result non critical range min value
de_de: Unterer Wert des unkritischen Bereichs
el_gr: Μη κρίσιμη ελάχιστη τιμή αποτελέσματος
it_it: Valore minimo range non critico

source: Quantitative result non critical range min unit
de_de: Einheit für die untere Grenze des nicht kritischen Bereiches
el_gr: Μονάδα μέτρησης μη κρίσιμης ελάχιστης τιμής αποτελέσματος
it_it: Unità di misura valore minimo range non critico

source: Collected by organization
de_de: Probenentnahme durch Einrichtung
el_gr: Συλλέχθηκε από τον οργανισμό
it_it: Eseguito da (nome laboratorio analisi)

source: Country of organization
de_de: Land der Einrichtung
el_gr: Χώρα οργανισμού
it_it: Nazione

source: City of organization
de_de: Stadt der Einrichtung
el_gr: Πόλη οργανισμού
it_it: Comune

source: Postalcode of organization
de_de: PLZ der Einrichtung
el_gr: Ταχυδρομικός κώδικας οργανισμού
it_it: CAP

source: Region of organization
de_de: Region der Einrichtung
el_gr: Περιοχή οργανισμού
it_it: Provincia

source: Street address of organization
de_de: Straße der Einrichtung
el_gr: Διεύθυνση οργανισμού
it_it: Indirizzo

source: Collected by (Doctor's family name)
de_de: Durchgeführt von (Name des Arztes)
el_gr: Συλλέχθει από (Επίθετο γιατρού)
it_it: Richiesto da (Cognome del medico)

source: Collected by (Doctor's name)
de_de: Durchgeführt von (Vorname des Arztes)
el_gr: Συλλέχθει από (Όνομα γιατρού)
it_it: Eseguito da (Nome del clinico)

source: Collected by role
de_de: Erfasst durch Rolle
el_gr: Συλλέχθηκέ από (επάγγελμα)
it_it: Eseguito da (ruolo)

source: Add New Lab
de_de: Neueen Labortest hinzufügen
el_gr: Νέο εργαστήριο
it_it: Aggiungi esame di laboratorio

source: Cancel
de_de: Abbrechen
el_gr: Άκυρο
it_it: Elimina

source: Collected by role
de_de: Erfasst durch Rolle
el_gr: Συλλέχθει από (ρόλος)
it_it: Eseguito da (ruolo)

source: Update Lab
de_de: Labortest aktualisieren
el_gr: Ενημέρωση εργαστηρίου
it_it: Aggiorna esame di laboratorio

source: Cancel
de_de: Abbrechen
el_gr: Άκυρο
it_it: Elimina

source: Archived Measurements List
de_de: Archivierte Messungen
el_gr: Λίστα μετρήσεων
it_it: Lista Misurazioni archiviate

source: Kind
de_de: Art
el_gr: Είδος
it_it: Tipo

source: Unit
de_de: Einheit
el_gr: Μονάδα
it_it: Unità

source: Measurements List
de_de: Messungen
el_gr: Λίστα μετρήσεων
it_it: Lista Misurazioni

source: add measurement
de_de: Messung hinzufügen
el_gr: εισαγωγή μέτρησης
it_it: Aggiungi una misurazione

source: deleted measurements
de_de: gelöschte Messungen
el_gr: [διεγραμμένες μετρήσεις]
it_it: Misurazioni eliminate

source: [add measurements]
de_de: [Messung hinzufügen]
el_gr: [εισαγωγή μετρήσεων]
it_it: [aggiungi misurazione]

source: [deleted measurements]
de_de: [gelöschte Messungen]
el_gr: [διεγραμμένες μετρήσεις]
it_it: [Misurazioni eliminate]

source: List View
de_de: Listenansicht
el_gr: Λίστα
it_it: Visualizzazione Lista

source: Graph View
de_de: Diagrammansicht
el_gr: Γραφήματα
it_it: Visualizzazione Grafico

source: Value/Unit
de_de: Wert/Einheit
el_gr: Τιμή/Μόναδα
it_it: Valore/Unità di misura

source: Selected Date
de_de: gewähltes Datum
it_it: Data selezionata

source: 'Please fill value.'
de_de: 'Bitte Wert eintragen.'
el_gr: 'Παρακαλώ συμπληρώστε την τιμή'
it_it: 'Per favore, inserisci il valore'

source: 'Please add number to value field'
de_de: 'Bitte Nummer in das Wertefeld eintragen.'
el_gr: 'Παρακαλώ συμπληρώστε με αριθμό την τιμή'
it_it: 'Per favore, inserisci un numero nel campo valore'

source: New Measurement
de_de: Neue Messung
el_gr: Νέα μέτρηση
it_it: Nuovo Misurazione

source: Number
de_de: Nummer
el_gr: Αριθμός
it_it: Numero

source: Pulse
de_de: Puls
el_gr: Παλμός
it_it: Frequenza Cardiaca

source: Body Temperature
de_de: Körpertemperatur
el_gr: Θερμοκρασία σώματος
it_it: Temperatura corporea

source: Measurement date
de_de: Messdatum
el_gr: Ημερομηνία μέτρησης
it_it: Data misurazione

source: Add New Measurement
de_de: Neue Messung hinzufügen
el_gr: Νέα μέτρηση
it_it: Aggiungi nuov misurazione

source: Update measurement
de_de: Messung aktualisieren
el_gr: Ενημέρωση πληροφοριών μέτρησης
it_it: Aggiorna misurazione

source: Deleted Medications List
de_de: gelöschte Medikamente
el_gr: Λίστα διεγραμμένων φαρμάκων
it_it: Lista farmaci eliminati

source: Quantity
de_de: Menge
el_gr: Ποσότητα
it_it: Dosaggio

source: Frequency
de_de: Einnahmehäufigkeit
el_gr: Συχνότητα
it_it: Frequenza

source: Started on
de_de: Start
el_gr: Ημερομηνία έναρξης
it_it: Inizio assunzione

source: Stopped on
de_de: Ende
el_gr: Ημερομηνίας λήξης
it_it: Interrotto il

source: Last filled
de_de: Letzter Eintrag
el_gr: Τελευταία συμπλήρωση
it_it: Ultima compilazione

source: Options
de_de: Optionen
el_gr: Επιλόγες
it_it: Opzioni

source: Stoped on
de_de: Ende
el_gr: Ημερομηνίας λήξης
it_it: Fine assunzione

source: Medications List
de_de: Medikamente
el_gr: Λίστα φαρμάκων
it_it: Lista farmaci

source: add a medication
de_de: Medikament hinzufügen
el_gr: [εισαγωγή φαρμάκου]
it_it: Aggiungi un farmaco

source: deleted medications
de_de: gelöschte Medikamente
el_gr: [διεγραμμένα φάρμακα]
it_it: Farmaci eliminati

source: [add a medication]
de_de: [Medikament hinzufügen]
el_gr: [εισαγωγή φαρμάκου]
it_it: [Aggiungi un farmaco]

source: [deleted medications]
de_de: [gelöschte Medikamente]
el_gr: [διεγραμμένα φάρμακα]
it_it: [farmaci eliminati]

source: 'Quantity value must be filled'
de_de: 'Messwert muss eingetragen werden'
it_it: 'Il valore Quantità deve essere inserito'

source: 'Quantity unit must be filled'
de_de: 'Einheit muss eingetragen werden'
it_it: 'L’unità di misura della Quantità deve essere inserita'

source: End date must be greater than Start date.
de_de: Das Enddatum muss hinter dem Startdatum liegen.
it_it: La data di fine deve essere successiva alla data di inizio

source: Quantity value (Example: 1)
de_de: Menge (z.B. 1)
it_it: Valore quantità (Esempio: 1)

source: -- select an option --
de_de: -- Option wählen --
it_it: Seleziona un’opzione

source: Quantity unit (Example tablet)
de_de: Einheit (z.B. Tablette)
it_it: Unità di misura quantità (Esempio: compresse)

source: Frequency value (Example: 1)
de_de: Häufigkeit (z.B. 1)
it_it: Valore frequenza (Esempio: 1)

source: Frequency unit (Example: per day)
de_de: Einheit (z.B. pro Tag)
it_it: Unità frequenza (Esempio: al giorno)

source: Pharmaceutical form
de_de: Pharmazeutische Form
it_it: Forma farmaceutica

source: Coated tablet
de_de: Überzogene Tablette
it_it: Compresse rivestite

source: Granulate
de_de: Granulat
it_it: Granulare

source: Capsule
de_de: Kapsel

source: Solution
de_de: Lösung
it_it: Soluzione

source: Lozenge
de_de: Lutschtablette

source: Juice
de_de: Saft
it_it: Succo

source: Sublingual tablet
de_de: Sublingualtablette
it_it: Compressa sublinguale

source: Tablet
de_de: Tablette
it_it: Compressa

source: Drop
de_de: Tropfen
it_it: Gocce

source: Salve
de_de: Salbe

source: End date
de_de: Enddatum
el_gr: Ημερομηνία λήξης
it_it: Data di fine

source: Start date
de_de: Startdatum
el_gr: Ημερομηνία έναρξης
it_it: Data di inizio

source: Fill date
de_de: Abfülldatum
el_gr: Ημερομηνία αγοράς φαρμάκου
it_it: Data di compilazione

source: Dispense days
de_de: Tage der Einnahme
el_gr: Ημέρες προμήθειας
it_it: 'Giorni o frequenza di assunzione'

source: 'Date of fill myst be filled'
de_de: 'Abfülldatum muss eingetragen werden'
el_gr: 'Συμπληρώστε την ημερομηνία'
it_it: 'Inserire la data di compilazione'

source: Update medication
de_de: Medikation aktualisieren
el_gr: Ενημέρωση πληροφοριών φαρμάκου
it_it: Aggiorna farmaco

source: https://www.youtube.com/embed/UiE3d1trYyU
de_de: https://www.youtube.com/embed/tb-nk-TvUzY
it_it: https://www.youtube.com/embed/7q_U6S_x8WU

source: Application
de_de: Anwendung
it_it: Farmaco

source: Works on:
de_de: Läuft auf:
