Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: ' Select Language '
de_de: 'Patient auswählen'
it_it: 'Seleziona un Paziente'

source: MEDICAL
de_de: MEDIZINISCH
el_gr: ΙΑΤΡΙΚΑ
it_it: MEDICO

source: QUESTIONNAIRES
de_de: FRAGEBÖDEN
el_gr: ΕΡΩΤΗΜΑΤΟΛΟΓΙΑ
it_it: QUESTIONARI

source: SETTINGS
de_de: EINSTELLUNGEN
el_gr: ΡΥΘΜΙΣΕΙΣ
it_it: IMPOSTAZIONI

source: Details
el_gr: Λεπτομέρειες
it_it: Dettagli

source: Toggle map
it_it: Cambia visualizzazione della mappa

source: Institution
el_gr: Ίδρυμα
it_it: Istituzione

source: Name
el_gr: Όνομασία
it_it: Nome

source: ALL
it_it: Tutto

source: AML
it_it: Leucemia mieloide acuta

source: M. Hodgkin
it_it: Linfoma Hodgkin

source: NHL
it_it: Linfoma non Hodgkin

source: Karnovsky Index
it_it: Scala di Karnofsky

source: Problem
el_gr: Λίστα προβλημάτων
it_it: Problema

source: Karnovsky Index
it_it: Scala di Karnofsky

source: Edit demographics
el_gr: Επεξεργασία δημογραφικών
it_it: Modifica dati demografici

source: SIOP
el_gr: Αριθμός ασφάλισης
it_it: Sistema di misurazione

source: Normal
el_gr: Κανονικό
it_it: Normale

source: Test name
el_gr: Εξέταση
it_it: Nome esame

source: Status
el_gr: Κατάσταση
it_it: Stato

source: Systole
el_gr: Συστολή
it_it: Sistolica

source: Diastole
el_gr: Διαστολή
it_it: Diastolica

source: Provider Hospital
it_it: Email prescrittore

source: Patient
el_gr: Ασθενείς
it_it: Paziente

source: Apps
el_gr: Εφαρμογές
it_it: Applicazioni

source: Login
el_gr: Σύνδεση
it_it: Accesso

source: update
el_gr: ενημέρωση
it_it: Aggiorna

source: Account ID:
el_gr: Κωδικός λογαρισμού:
it_it: ID account:

source: Psycho-emotional profiler
el_gr: Ψυχο-συναισθηματική Ενδυνάμωση
it_it: Profilo psico-emotivo

source: Annotator
it_it: Note

source: ' About '
it_it: 'Informazioni'

source: INFO
el_gr: ΠΛΗΡΟΦΟΡΙΕΣ
it_it: INFORMATIONI

source: Agenda
el_gr: Ατζέντα

source: OK
el_gr: Εντάξει

source: Email:
el_gr: Ηλεκτρονικη διεύθυνση(email)

source: Link
el_gr: Σύνδεσμος

source: Email
el_gr: Ηλεκτρονικη διεύθυνση(email)

source: Min
el_gr: Ελάχιστο

source: Max
el_gr: Μέγιστη

source: E-mail
el_gr: Ηλεκτρονικη διεύθυνση

source: Account Email:
el_gr: Ηλεκτρονική διεύθυνση:

source: Healthfeed
el_gr: Νέα

source: Suffix
el_gr: Κατάληξη

source: mm
el_gr: μήνας
