Repository: Chatzimina/indivo_ui_server
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de_de, el_gr, it_it

source: iManageMyHealth is a multipurpose informative app for Android phones (Android 5 and higher) for general health management. It supports you in taking your drugs and provides you information on your drugs and their interactions. Further to this, the app helps you in managing and understanding your paper based health documents, as wells in recording and overviewing specific vital signs and laboratory parameters. Finally, the app also provides specific management services in the context of cancer, as for pain that record the felt level of pain and link to helpful public information resources.
de_de: iManageMyHealth ist eine vielseitige informative App für Android-Geräte (Android 5 und höher) zum allgemeinen Gesundheitsmanagement. Die App unterstützt Sie beim Einnehmen Ihrer Medikamente und stellt Ihnen Informationen zu Ihren Medikamenten und deren Wechselwirkungen zur Verfügung. Ferner hilft Ihnen die App beim Verwalten und Verstehen Ihrer papierbasierten Gesundheitsdokumente sowie beim Dokumentieren spezieller Vitaldaten und Labordaten. Schließlich stellt die App auch spezielle Managementdienste im Zusammenhang mit Krebs bereit, wie etwa für Schmerzen, um die Stärke der Schmerzen aufzuzeichnen und auf hilfreiche, öffentliche Informationsquellen zu verweisen.
it_it: iManageMyHealth è un applicazione per dispositivi Android (Android 5 e superiori) pensata per la gestione della propria salute. L’applicazione vi supporterà quando sarà il momento di prendere i vostri farmaci e vi fornirà informazioni sui farmaci e sulle loro interazioni. Inoltre, l’applicazione vi aiuterà nella gestione e nella comprensione dei vari documenti medici e vi permetterà di registrare gli esiti degli esami di laboratorio e delle varie misurazioni (ad esempio pressione sanguigna, temperatura corporea, ecc…). Infine, l’applicazione prevede anche alcune funzioni speciali per la gestione delle problematiche oncologiche come, ad esempio, la registrazione del livello del dolore, nonché la possibilità di accedere a documenti e/o a siti utili per la gestione della malattia.

source: Download
de_de: Herunterladen

source: The MyHealthAvatar App helps weight control, calorie control and promotes physical exercises. There is strong evidence that weight problems can increase the risks of affecting the treatment of many different types of cancers, for example prostate cancer- a healthy weight means the cancer is less likely to spread after surgery or radiotherapy. Hormone therapy may also be more effective if the patients maintain a healthy weight. Many side effects from the treatment are much easier to cope with after the surgery with a healthy weight. Therefore, the App offers a healthy lifestyle to the user in order to reduce the risk of many health problems. The MyHealthAvatar App offers a range of tools for the self-management of cancer in terms of lifestyle and physical activities. These Suites can be accessed through a mobile application. These Suites are mainly designed to target patients with prostate cancers and help them to: <ul><li> Know their health status and performance by viewing their self-collected data </li><li> Improve their knowledge about health and diseases by tailored information provision </li><li> Raise their risk awareness and perceptions about diseases by personalised risk assessment</li> <li> Engage in health and fitness activities by recommending relevant programmes and courses </li><li> Help look after weight, fitness, calories, mood and sleep. </li></ul>
de_de: Die App MyHealthAvatar hilft bei der Gewichts- und Kalorienkontrolle und fördert körperliche Übungen. Es gibt starke Hinweise darauf, dass Gewichtsprobleme die Behandlung von vielen Tumorarten beeinträchtigen können. Bei Prostatakrebs beispielsweise breitet sich bei einem gesunden Gewicht der Krebs nach Chirurgie oder Strahlentherapie weniger häufig wieder aus. Hormontherapie kann ebenso effektiver sein, wenn der Patient ein gesundes Gewicht beibehält. Nach Chirurgie sind viele Nebenwirkungen der Behandlung mit einem gesunden Gewicht leichter zu bewältigen. Daher fördert die App einen gesunden Lebensstil, um die Risiken für viele Gesundheitsprobleme zu reduzieren. Die MyHealthAvatar-App bietet eine Reihe von Werkzeugen zum Selbstmanagement bei Krebs in Bezug auf Lebensstil und körperlicher Aktivität. Diese Werkzeuge sind über eine mobile Anwendung zugänglich. Sie sind vor allem darauf ausgelegt Patienten mit Prostatakrebs zu unterstützen:<ul><li>Kennen Sie Ihren Gesundheitszustand und Ihre Leistung, indem Sie sich Ihre selbst gesammelten Daten ansehen.</li><li> Verbessern Sie Ihr Wissen über Gesundheit und Krankheiten durch maßgeschneiderte Informationsbereitstellung.</li><li> Erhöhen Sie Ihr Risikobewusstsein und die Wahrnehmung von Krankheiten durch personalisierte Risikobewertung.</li><li> Engagieren Sie sich in Gesundheit- und Fitnessaktivitäten durch die Empfehlung von relevanten Programmen und Kursen.</li><li> Erhalten Sie Hilfe beim Regulieren von Gewicht, Fitness, Kalorien, Stimmung und Schlaf.</li></ul>
it_it: L’applicazione MyHealthAvatar è di aiuto nel monitorare il proprio peso, stimare le calorie assunte durante il giorno e nel promuovere l’esercizio fisico. E’ stato dimostrato che i problemi di peso possono avere delle ripercussioni sul trattamento di diversi tipi di tumori, come ad esempio il tumore alla prostata. Ciò significa che se si raggiunge o mantiene il proprio peso forma il cancro ha meno probabilità di diffondersi dopo l’intervento chirurgico o la radioterapia, la terapia ormonale risulta essere più efficace molti effetti collaterali dei vari trattamenti sono più facili da affrontare. Pertanto, l’applicazione propone agli utilizzatori alcuni consigli ed esercizi per mantenere uno stile di vita corretto e salutare al fine di ridurre il rischio di incorrere in problemi di salute. L’applicazione MyHealthAvatar offre una gamma di strumenti utili per la gestione della propria patologia proponendo esercizi per il benessere fisico e fornendo indicazioni utili per uno stile di vita sano. La suite è accessibile tramite smartphone ed è progettata principalmente per i pazienti con tumore alla prostata i quali utilizzandola potranno:<ul><li> Conoscere il proprio stato di salute e le proprie prestazioni visualizzando i dati personali raccolti;</li><li> Migliorare la conoscenza della propria patologia e del proprio stato di salute mediante tutta una serie di informazioni personalizzate e su misura;</li><li> Aumentare la consapevolezza e la percezione dei rischi associati alla propria patologia mediante una valutazione personalizzata del rischio;</li><li> Impegnarsi nell’attività fisica mediante corsi e programmi di esercizi suggeriti dall applicazione;</li><li> Avere cura della propria forma fisica, della propria alimentazione, dell’umore e del sonno.</li></ul>

source: The MyHealthAvatar App helps weight control, calorie control and promotes physical exercises. There is strong evidence that weight problems can increase the risks of affecting the treatment of many different types of cancers, for example, breast cancer- a healthy weight means the cancer is less likely to spread after surgery or radiotherapy. Hormone therapy may also be more effective if the patients maintain a healthy weight. Many side effects from the treatment are much easier to cope with after the surgery with a healthy weight. Therefore, the App offers a healthy lifestyle to the user in order to reduce the risk of many health problems. The MyHealthAvatar App offers a range of tools for the self-management of cancer in terms of lifestyle and physical activities. These Suites can be accessed through a mobile application. These Suites are mainly designed to target patients with breast cancers and help them to:<ul><li>Know their health status and performance by viewing their self-collected data</li><li> Improve their knowledge about health and diseases by tailored information provision</li><li> Raise their risk awareness and perceptions about diseases by personalised risk assessment</li><li> Engage in health and fitness activities by recommending relevant programmes and courses</li><li> Help look after weight, fitness, calories, mood and sleep. </li> </ul>
de_de: Die App MyHealthAvatar hilft bei der Gewichts- und Kalorienkontrolle und fördert körperliche Übungen. Es gibt starke Hinweise darauf, dass Gewichtsprobleme die Behandlung von vielen Tumorarten beeinträchtigen können. Bei Prostatakrebs beispielsweise breitet sich bei einem gesunden Gewicht der Krebs nach Chirurgie oder Strahlentherapie weniger häufig wieder aus. Hormontherapie kann ebenso effektiver sein, wenn der Patient ein gesundes Gewicht beibehält. Nach Chirurgie sind viele Nebenwirkungen der Behandlung mit einem gesunden Gewicht leichter zu bewältigen. Daher fördert die App einen gesunden Lebensstil, um die Risiken für viele Gesundheitsprobleme zu reduzieren. Die MyHealthAvatar-App bietet eine Reihe von Werkzeugen zum Selbstmanagement bei Krebs in Bezug auf Lebensstil und körperlicher Aktivität. Diese Werkzeuge sind über eine mobile Anwendung zugänglich. Sie sind vor allem darauf ausgelegt Patienten mit Prostatakrebs zu unterstützen:<ul><li>Kennen Sie Ihren Gesundheitszustand und Ihre Leistung, indem Sie sich Ihre selbst gesammelten Daten ansehen.</li><li> Verbessern Sie Ihr Wissen über Gesundheit und Krankheiten durch maßgeschneiderte Informationsbereitstellung.</li><li> Erhöhen Sie Ihr Risikobewusstsein und die Wahrnehmung von Krankheiten durch personalisierte Risikobewertung.</li><li> Engagieren Sie sich in Gesundheit- und Fitnessaktivitäten durch die Empfehlung von relevanten Programmen und Kursen.</li><li> Erhalten Sie Hilfe beim Regulieren von Gewicht, Fitness, Kalorien, Stimmung und Schlaf.</li></ul>
it_it: L’applicazione MyHealthAvatar è di aiuto nel monitorare il proprio peso, stimare le calorie assunte durante il giorno e nel promuovere l’esercizio fisico. E’ stato dimostrato che i problemi di peso possono avere delle ripercussioni sul trattamento di diversi tipi di tumori, come ad esempio il tumore alla prostata. Ciò significa che se si raggiunge o mantiene il proprio peso forma il cancro ha meno probabilità di diffondersi dopo l’intervento chirurgico o la radioterapia, la terapia ormonale risulta essere più efficace molti effetti collaterali dei vari trattamenti sono più facili da affrontare. Pertanto, l’applicazione propone agli utilizzatori alcuni consigli ed esercizi per mantenere uno stile di vita corretto e salutare al fine di ridurre il rischio di incorrere in problemi di salute. L’applicazione MyHealthAvatar offre una gamma di strumenti utili per la gestione della propria patologia proponendo esercizi per il benessere fisico e fornendo indicazioni utili per uno stile di vita sano. La suite è accessibile tramite smartphone ed è progettata principalmente per i pazienti con tumore alla prostata i quali utilizzandola potranno:<ul><li> Conoscere il proprio stato di salute e le proprie prestazioni visualizzando i dati personali raccolti;</li><li> Migliorare la conoscenza della propria patologia e del proprio stato di salute mediante tutta una serie di informazioni personalizzate e su misura;</li><li> Aumentare la consapevolezza e la percezione dei rischi associati alla propria patologia mediante una valutazione personalizzata del rischio;</li><li> Impegnarsi nell’attività fisica mediante corsi e programmi di esercizi suggeriti dall applicazione;</li><li> Avere cura della propria forma fisica, della propria alimentazione, dell’umore e del sonno.</li></ul>

source: The serious game for kids is a classical shooter game - flying with a vessel from left to the right through several parts of the human body and shooting on obstacles and dangerous cancer cells - with strong social aspects, developed for mobile devices as smartphones and tablets. The serious game for kids can be played in three modes, patient, family and friends. Patient is always a child in need of supported from family and friends. Support is given in form of extra weapons and shields for the child.
de_de: Das Seriöse Spiel für Kinder ist ein klassisches Shooter-Spiel mit starken sozialen Komponenten, entwickelt für mobile Geräte wie Smartphones und Tablets. Dabei fliegt der Spieler mit einem Gefährt von links nach rechts durch verschiedene Teile des Körpers und schießt dabei auf Hindernisse und gefährliche Krebszellen. Das Seriöse Spiel für Kinder kann in drei verschiedenen Modi gespielt werden, als Patient, Familienmitglied und Freund. Die Patienten-Rolle übernimmt dabei das Kind, welches von Familie und Freunden unterstützt werden soll. Unterstützung wird dabei in Form von Extrawaffen und -schilden übermittelt.
it_it: Il serious game per bambini è un classic shooter game per dispositivi mobili come tablet e smartphone, in cui si pilota una navicella da sinistra verso destra, attraversando diverse parti del corpo umano e sparando agli ostacoli e alle cellule cancerose, con un forte accento sulla socializzazione. Il serious game per bambini può essere giocato in tre modalità: paziente, familiari e amici. Il paziente è il bambino, che può richiedere supporto alla famiglia ed agli amici. Il supporto nel gioco viene dato sotto forma di armi aggiuntive e scudi per il bambino

source: The aim of the serious game for adults is to augment the capacity of the iManageCancer platform in promoting self-management through a stylised simulation game, and promote self-efficacy, i.e. the belief of the patients to be able to manage and to face their disease, also to help the patients deal with the psychological dimension of their disease, promote a healthier lifestyle and disease management. The game puts the user in the role of an authority figure who manages a small town where they help residents with their cancer related lifestyle problems. The user is forced to think critically and strategically in order to balance their resources and time, while also viewing the issues surrounding their cancer from a different perspective. The broad targets of the serious game are listed as:<ul><li> Learn healthier life-styles (balanced diet, appropriate physical exercise) and increase problem solving skills (adjustment-oriented self-management approach) </li><li>To create a game that educates patients (and individuals) to healthy behaviours while having fun </li><li>Improve self-efficacy in self-management skills through mastery and vicarious experience of the Avatar in the Serious game.</li></ul>
de_de: Das Ziel des Seriösen Spiels für Erwachsene ist es, die iManageCancer-Plattform zur Förderung des Selbstmanagements bei Krebserkrankungen durch ein stilisiertes Simulationsspiel zu erweitern, das das Selbstvertrauen der Patienten fördert. Das heißt es stärkt den Glauben der Patienten, in der Lage zu sein, ihre Krankheit anzunehmen und zu bewältigen, hilft ihnen bei der psychologischen Dimension ihrer Krankheit, fördert einen gesünderen Lebensstil und unterstützt das Krankheitsmanagement. Das Spiel stellt den Benutzer in die Rolle einer Autoritätsfigur, die eine kleine Stadt verwaltet, wo man den Bewohnern mit ihren krebsbedingten Lebensstilproblemen hilft. Der Benutzer ist gezwungen, kritisch und strategisch zu denken, um mit seinen Ressourcen und seiner Zeit hauszuhalten, während er dabei die Probleme rund um seine Krebserkrankung aus einer anderen Perspektive sieht. Die breiten Ziele des Seriösen Spiels sind aufgeführt als:<ul><li>Lernen Sie gesündere Lebensstile (ausgewogene Ernährung, angemessene körperliche Bewegung) und erhöhen Sie ihre Problemlösungskompetenz (anpassungsorientiertes Selbstmanagement)</li><li> Ein Spiel zu schaffen, das Patienten (und Einzelpersonen) zu gesunden Verhaltensweisen erzieht, während sie Spaß haben</li><li> Verbesserung des Selbstvertrauens in die Selbst-Management-Fähigkeiten durch die stellvertretende Erfahrung und Meisterung des Avatar in dem Seriösen Spiel.</li></ul>
it_it: Lo scopo di questo gioco è quello di incrementare le potenzialità della piattaforma iManageCancer nel promuovere la gestione personale della propria salute attraverso un gioco di simulazione. Il gioco ha lo scopo di promuovere l auto-efficacia dei pazienti cioè la convinzione che è possibile gestire e affrontare la propria malattia. Questo gioco dovrebbe inoltre essere di aiuto nell’affrontare la dimensione psicologica della propria malattia incoraggiando a mantenere uno stile di vita sano al fine di gestire meglio i vari aspetti legati alla malattia. Nel gioco l’utente vestirà i panni dell’amministratore di una piccola città che deve aiutare gli abitanti a gestire le varie problematiche quotidiane associate al cancro. Il giocatore dovrà sforzarsi di pensare in modo critico e strategico per bilanciare le risorse e il tempo a disposizione in modo da affrontare le problematiche legate al cancro da una prospettiva diversa. Gli obbiettivi principali del gioco saranno:<ul><li> Imparare stili di vita più sani (dieta equilibrata, esercizi fisici appropriati) e aumentare le abilità di risoluzione dei problemi (approccio di auto-gestione orientato alla regolazione e al controllo);</li><li> Educare in modo divertente a seguire comportamenti sani, migliorandone l’efficacia;</li><li> Migliorare le abilità di gestione della propria salute e della propria malattia controllando e interagendo con il proprio avatar nel gioco.</li></ul>

source: Start date must be filled
de_de: Startdatum muss eingetragen werden
it_it: 'Aggiungere la data di inizio assunzione'

source: End date must be greater than Onset date.
de_de: Das Enddatum muss hinter dem Startdatum liegen.
it_it: La data di fine assunzione dev’essere successive alla data di inizio assunzione

source: Hours
de_de: Stunden
it_it: Ore

source: Minutes
de_de: Minuten
it_it: Minuti

source: (if there is no end date the problem would not me visible in calendar)
de_de: (wenn kein Enddatum angegeben ist, ist das Problem im Kalender nicht sichtbar)
it_it: (se non è inserita una data di fine del problema, questo non sarà visibile sul calendario)

source: Add New Problem
de_de: Neues Problem hinzufügen
el_gr: Εισαγωγή νέου πρόβληματος
it_it: Aggiungi nuovo problema

source: Date
de_de: Datum
it_it: Data

source: Procedures List
de_de: Prozeduren
el_gr: Λίστα επεμβάσεων
it_it: Lista Interventi

source: Date performed
de_de: Ausführungsdatum
el_gr: Ημερομηνία
it_it: Data di esecuzione

source: add a procedure
de_de: Prozedur hinzufügen
el_gr: [εισαγωγή επέμβασης]
it_it: Aggiungi un intervento

source: deleted procedures
de_de: Gelöschte Prozeduren
el_gr: [διεγραμμένες επεμβάσεις]
it_it: Interventi eliminati

source: Hospital
de_de: Krankenhaus
it_it: Ospedale

source: [add a procedure]
de_de: [Prozedur hinzufügen]
el_gr: [εισαγωγή επέμβασης]
it_it: [aggiungi un intervento]

source: [deleted procedures]
de_de: [gelöschte Prozeduren]
el_gr: [διεγραμμένες επεμβάσεις]
it_it: [interventi eliminati]

source: Insert medical treatments or operations. For example: 'Biopsy', 'Eye surgery', 'Magnetic Resonance Imaging (MRI Scan)'
de_de: Tragen Sie medizinische Behandlungen oder Operationen ein. Zum Beispiel: 'Biopsie', 'Augenoperation', 'Magnetresonanztomographie (MRT)'
it_it: Risonanza Magnetica (RM)

source: Provider Name
de_de: Name des Anbieters
el_gr: Όνομα παρόχου
it_it: Nome della farmacia

source: Update Procedure
de_de: Prozedur aktualisieren
el_gr: Ενημέρωση πληροφοριών επέμβασης
it_it: Aggiorna Intervento

source: Content purported to be compressed with %s but failed to decompress.
de_de: Der Inhalt wurde scheinbar mit %s komprimiert, konnte aber nicht dekomprimiert werden.
el_gr: Περιεχόμενο με σκοπο να συμπιεστεί με% s, αλλά απέτυχε στην αποσυμπίεση.

source: Unsupported value for qop: %s.
de_de: Nicht unterstützter Wert für qop: %s.
el_gr: Μη υποστηριζόμανη τιμή για qop %s.

source: Unsupported value for algorithm: %s.
de_de: Nicht unterstützter Wert für Algorithmus: %s.
el_gr: Μη υποστηριζόμενη τιμή για τον αλγοριθμο %s.
it_it: Valore non supportato per l'algoritmo: %s

source: The challenge doesn't contain a server nonce, or this one is empty.
de_de: Die Challenge enthält keinen Server-Nonce, oder der Server-Nonce ist leer.

source: Unsupported value for pw-algorithm: %s.
de_de: Nicht unterstützter Wert für pw-Algorithmus: %s.
it_it: Valore non supportato per l'algoritmo-pw: %s

source: Redirected but the response is missing a Location: header.
de_de: Umleitung erfolgreich, aber die Antwort enthält keine Ortsinformation im Header

source: Setup
de_de: Konfiguration
el_gr: Ρύθμιση
it_it: Impostazioni

source: Enter the confirmation code to activate your account
de_de: Bitte geben Sie den Bestätigungscode ein, um Ihren Account zu aktivieren
el_gr: Εισάγεται τον κωδικό που λάβατε στο email για να ενεργοποιήσετε τον λογαριασμό σαςΕισάγετε τον κώδικο επιβεβαίωσης για να ενεργοποιήσετε τον λογαριασμό σας
it_it: Inserire il codice di conferma per attivare l'account

source: Confirmation code:
de_de: Bestätigungscode:
el_gr: Κώδικός επιβεβαίωσης
it_it: Codice di conferma:

source: Activate Account
de_de: Account aktivieren
el_gr: Ενεργοποίηση λογαριασμού
it_it: Attiva account

source: Lost your confirmation code?
de_de: Bestätigungscode verloren?
el_gr: Χάσατε τον κωδικί επιβεβαίωσης;
it_it: Hai perso il codice di conferma?

source: More Characters
de_de: Mehr Zeichen
el_gr: Περισσότεροι χαρακτήρες
it_it: Più caratteri

source: Strong!
de_de: Stark!
el_gr: Δυνατός κωδικός!
it_it: Forte!

source: Medium!
de_de: Mittel!
el_gr: Μεσαίος κωδικός!
it_it: Medio!

source: Weak!
de_de: Schwach!
el_gr: Αδύναμος κωδικός!
it_it: Debole!

source: Account setup for
de_de: Account Konfiguration für
el_gr: Ρύθμιση λογαριασμού για
it_it: Impostazioni account per

source: Please choose a username and password for your account
de_de: Bitte Benutzername und Passwort für Ihren Account wählen
el_gr: Παρακαλώ επιλέξτε ένα ψευδώνυμο και ένα κωδικό για τον λογαριασμό σας
it_it: Scegliere username e password per l'account

source: Username
de_de: Benutzername
el_gr: Ψευδώνυμο

source: No spaces please
de_de: Bitte keine Leerzeichen
el_gr: Χωρίς κενά παρακαλώ
it_it: Non utilizzare spazi per favore

source: Password:
de_de: Passwort:
el_gr: Κωδικός:

source: characters or more
de_de: Zeichen oder mehr
el_gr: χαρακτήρες η περισσότεροι
it_it: o più caratteri

source: Confirm Password:
de_de: Passwort bestätigen:
el_gr: Επιβεβαίωση κωδικού
it_it: Conferma password

source: Passwords must match
de_de: Passwörter müssen übereinstimmen
el_gr: Οι κωδικόι πρέπει να ταιριάζουν μεταξύ τους
it_it: Le password non coincidono

source: Setup Account
de_de: Account konfigurieren
el_gr: Ρύθμιση Λογαριασμού
it_it: Impostazioni account

source: Administration Console
de_de: Administrationskonsole
el_gr: Κονσόλα διαχείρισης
it_it: Registrazione

source: Add new administrator
de_de: Neuen Administrator hinzufügen
el_gr: Εισαγωγή διαχειριστή
it_it: Registrazione

source: Send a Message
de_de: Nachricht schreiben
el_gr: Αποστολή μηνύματος
it_it: Crea messaggio

source: Send All
de_de: An alle senden
el_gr: Αποστολή σε όλους
it_it: Invia tutto

source: Users
de_de: Benutzer
el_gr: Χρήστες

source: New Users
de_de: Neue Benutzer
el_gr: Νέοι χρήστες
it_it: Nuova Allergia

source: New Entries
de_de: Neue Einträge
el_gr: Νέες εισαγωγές
it_it: Nuovo evento

source: Audit Visualization
de_de: Verwaltung
it_it: Registrazione

source: Problem Reports
de_de: Problemberichte
it_it: Problemi

source: Full name
de_de: Vollständiger Name
el_gr: Επίθετο
it_it: Cognome

source: Role
de_de: Rolle
el_gr: Ρόλος
it_it: Ruolo

source: From
de_de: Von
el_gr: Από
it_it: Da

source: To
de_de: Für
el_gr: Σε
it_it: A

source: Search
de_de: Suche
el_gr: Αναζήτηση
it_it: Cerca

source: Reset
de_de: Zurücksetzen
el_gr: Επαναφορά
